[
  {
    "today": {
      "text": "Feb 4, 2021 - A trip of some kind might have to be postponed, as computers and other technology involved in your arrangements might be temporarily out of operation. This can prove frustrating, Aries, but it's beyond your control. The best thing to do is make new arrangements and move on. For the most part, everything is going very well for you, so don't give in to panic. Hang in there.",
      "matches": [
        10,
        3,
        7
      ],
      "ratings": [
        3,
        3,
        4,
        4
      ],
      "money": []
    },
    "yesterday": {
      "text": "Feb 3, 2021 - A quick survey of the financial news might reveal that your investments, particularly those involving property, might be worth far more than you thought, Aries. This might make you wonder if you should sit back and let it all mount up or actively put it to work for you. Consult a professional before taking any immediate action. You will want to be sure you're doing the right thing.",
      "matches": [
        10,
        4,
        7
      ],
      "ratings": [
        4,
        3,
        4,
        3
      ],
      "money": []
    },
    "tomorrow": {
      "text": "Feb 5, 2021 - Your focus today is likely to be on learning. Something you've wanted to study for a long time may finally be within your grasp. Perhaps money makes this possible, or you've finally settled on a workable course of action. Travel might be involved. If you've been thinking about going back to school, get everything started today. If you do, you will probably attain what you want. Go for it.",
      "matches": [
        9,
        5,
        6
      ],
      "ratings": [
        3,
        4,
        2,
        4
      ],
      "money": []
    },
    "week": {
      "text": "Feb 1, 2021 - Feb 7, 2021 - You’re lucky in love this week when Venus enters Aquarius on Monday, creating the perfect time to start a love affair. During the next few weeks, your DMs will be blowing up with messages from potential romantic partners. You might even discover that you’re attracted to people you weren’t expecting to fall for at all. Let your inner rebel out and break a few dating rules. Going off the beaten path could lead to love.If you’re in a relationship, Venus in Aquarius can put the spice back in a tired routine. Enjoying interesting date nights, being a little rebellious, and getting very lucky in the bedroom are all possible during this time. Get weird!However, watch out for burnout. On Saturday, Venus conjoins Saturn in Aquarius, creating tension between wanting to be social and wanting to be left alone. Friendships and relationships could suffer if you opt for isolation. ",
      "love": "Feb 1, 2021 - Feb 7, 2021 - When the sun squares your ruler, powerful Mars, at the beginning of the week, people might challenge your romantic beliefs and customs. What do you truly believe in? This is a good time to speak your mind.Venus, the goddess of love, partners with eccentric Aquarius around the same time, so the line between friendship and love is blurry. Do you have a close friend you’re attracted to? Explore your options.There’s a Venus-Saturn conjunction at the end of the week that could cause an intense feeling of loneliness. There’s a difference between being alone and being lonely, but they seem like the same thing to you now.",
      "career": "Feb 1, 2021 - Feb 7, 2021 - You're very aware of where you stand financially, which in turn is going to encourage you to work harder. This is an excellent time for coming up with ideas for new income streams and exciting business projects. You may have to abandon one business relationship that threatens to become too demanding. However, you may be thinking about creating a partnership with someone more compatible.",
      "wellness": "Feb 1, 2021 - Feb 7, 2021 - You may have to undo the effects of any recent parties or big social events before you can get back into the same shape as before. Don't feel downhearted if you've put on weight or gotten out of the habit of regular exercise. You can get back on track. Just do it one day at a time and be consistent. Think positive thoughts to focus your efforts constructively.",
      "money": "Feb 1, 2021 - Feb 7, 2021 - You have a time of communication in order to exchange ideas. This can be very conducive to starting a new career or advancing in the one you have. All that's required is to be true to yourself. Aspects affecting communication make you a little quirky and unique. You don't care what others think, which makes it so much easier for you to ask for what you're worth.",
      "matches": [
        10,
        3,
        7
      ],
      "ratings": [
        3,
        3,
        4,
        4
      ]
    },
    "month": {
      "text": "February 2021 - February arrives with a major focus on your finances, Aries. This is because your ruler Mars powers up this sector again this month. It could increase your expenses during this time but also give you the drive to make so much more. This would be an excellent time to look for a better paying job or, if you freelance, hunt down more clients.Venus, planet of pleasure, dances through your solar eleventh house from February 1 until February 25, bringing laughter, joy, and sweetness to your social life. With a new moon arriving in this same sphere on the eleventh, you will surely hear from many friends in the week that follows. You might even be invited to an event that holds both personal and professional opportunities for you.Take it slowly this month, though, especially because Mercury is retrograde until February 20. You may even hear from old friends or contacts during this time.To end the month, a full moon in your solar sixth house rises in the night of the twenty-seventh. This can make you extremely productive, and it may have you finishing up an important project for your employer. If you’re looking for a new job, you could see one appear at this time.This same luminary could instead turn your attention to your health, fitness, or diet, so if something pops up, handle it now. Some of you could decide it’s time to start a new exercise regimen that can energize your life.Standout days: 11, 13, 15Challenging days: 6, 17, 19",
      "matches": [
        10,
        3,
        7
      ],
      "ratings": [
        3,
        3,
        4,
        4
      ],
      "money": []
    },
    "year": {
      "text": "\nThere is a great deal to be learned through the other side of the story these days, Aries. 2020 brought out your more practical and protective side. You were forced to dive so deeply inward, and now you know what you are able to take, and what you can no longer tolerate in your life.\n\nAs you pummel into 2021 with your naturally inquisitive nature, there can be an honest review of where you want to direct the show. This means that you must take authority back in some capacity throughout the year.\n\nSaturn's influence in Aquarius sextiles your sign nicely, giving you a boost of confidence in your career pursuits. This energy can even help you heal some issues around respect and open your mind to new and different methods of leadership. This holds true for you even when a square formed between Saturn in the Water-bearing sign and Uranus in your neighboring sign of Taurus on February 17, June 14, and December 24. There's a direct emphasis on your self-worth during these months as you become more aware of what is best for the greater good.\n\nYou might feel torn at times if you are striving hard and finding strength by following your own direction. If you keep your eye on the prize, you will not leave anyone behind. In fact, you are carving a lesser-known path to lead the way for an entire community. This year, certain lunar eclipses vacillate between Sagittarius and Gemini, activating your personal zones of higher learning and spiritual development, and requiring you to find the words for what you are feeling.\n\nIn 2021, you might have many moments of precognition or feel more in alignment with your intuition, especially surrounding the Sagittarian eclipses, being a May 26 total lunar eclipse and a total solar eclipse on December 4.\n",
      "matches": [],
      "ratings": [],
      "money": [],
      "love": [],
      "career": [],
      "wellness": []
    }
  },
  {
    "today": {
      "text": "Feb 4, 2021 - Some upsetting dreams might haunt you today, Taurus. They might evoke some uncomfortable emotional issues. You might be a bit edgy emotionally and more likely to overreact when other people quarrel or machines break down. It might be a good idea to analyze your dreams first thing in the morning so you can learn from and release them. That way you will be more balanced throughout your day.",
      "matches": [
        10,
        6,
        7
      ],
      "ratings": [
        3,
        4,
        2,
        4
      ],
      "money": []
    },
    "yesterday": {
      "text": "Feb 3, 2021 - A message could come today from a business or romantic partner that brings some welcome news, Taurus. Action on an enterprise of some kind, perhaps involving writing or speaking, could put one or both of you in the limelight. Make the most of the opportunity. It could lead to future advancement and exposure, perhaps even more promising than this. You've worked hard and now you're reaping the rewards.",
      "matches": [
        11,
        4,
        8
      ],
      "ratings": [
        3,
        3,
        4,
        4
      ],
      "money": []
    },
    "tomorrow": {
      "text": "Feb 5, 2021 - If you've been investing, look for it to pay off big. Or you could execute a new contract, settle a claim, or even win something. Expect the unexpected where money is concerned. It might have you reeling. In the past few weeks you've been releasing a lot of negative energy and clearing the way for today's good fortune. Plan to have some wonderful dreams tonight as well.",
      "matches": [
        12,
        6,
        9
      ],
      "ratings": [
        4,
        2,
        4,
        4
      ],
      "money": []
    },
    "week": {
      "text": "Feb 1, 2021 - Feb 7, 2021 - On Monday, Venus enters Aquarius and your career zone. If you’ve been struggling with your career goals lately, it might be time to change your approach.Use the innovative energies of the Water Bearer to think outside the box to get ahead. By coming up with new ideas, you could speed up your long-term goals and make them possible sooner. Brainstorm, Taurus! Sure, this may give you the reputation of being a little â\u0080\u009cout there,â\u0080\u009d but it will be worth it when you get the results you want. Just keep going.However, you might have to deal with some tension at work when Venus conjoins Saturn on Saturday. Someone may feel threatened by your success and want to isolate you or block your progress. Or your new reputation could scare people away. Don’t let these people bother you. Instead, just focus on yourself and keep your personal life private.",
      "love": "Feb 1, 2021 - Feb 7, 2021 - The sun-Mars square in the first part of the week has you wondering why you’re the only one around who seems like they aren’t happily in love. Of course, this isn’t the case, but your pessimistic thinking can put you in a very negative space now.Lovely Venus, your home planet, highlights friendship as it enters Aquarius early this week, so don’t rule anyone out. Is it possible that someone you’ve been close to all these years could be your soul mate? The line between romance and platonic love is fuzzy now.There’s a Venus-Saturn conjunction at the end of the week that has you thinking about your future love life, specifically as it relates to money and\/or your career. Is there room in your life for love? You might need to make some adjustments.",
      "career": "Feb 1, 2021 - Feb 7, 2021 - The cosmos may bring powerful emotions to the surface, so try not to let everything get blown out of proportion. If you have important business decisions to make, it may be better to hold off a while until everyone, including you, has calmed down. This period could bring an opportunity for a lucrative deal. Overall, you'll do better if you can enlist the help of others and work as a team.",
      "wellness": "Feb 1, 2021 - Feb 7, 2021 - You might want to learn more about how to get fit or understand the best nutritional path for you. This is a great opportunity to research anything that has mystified you. If you need advice, you might join a related online forum or local fitness group where you can pick other people's brains and share your experiences. That way you can educate each other.",
      "money": "Feb 1, 2021 - Feb 7, 2021 - For you, this week is about unexpected change, meaning you may be temporarily destabilized. If you're doing well, you may have to deal with a reversal of fortune, or vice versa. Don't assume anything will last forever. However, another aspect encourages you to discover your true voice, especially when it comes to work. You have something to say.",
      "matches": [
        10,
        6,
        7
      ],
      "ratings": [
        3,
        4,
        2,
        4
      ]
    },
    "month": {
      "text": "February 2021 - You are nearly unstoppable in February, Taurus! That’s because you’re energized by the tremendous power of Mars through the entire month. You’ll be fired up to tackle your goals and able to make a great deal of progress on any of your personal or professional plans. Take the initiative. Be a leader. Don’t sit in the shadows.However, despite your enthusiasm, this month could see some delays regarding career matters with Mercury retrograde until February 20. Try not to sign any contracts or agree to anything during this time because it could end up shifting later down the line. This could prove difficult to do, though, because the new moon on the eleventh is sure to bring some fresh opportunities your way. If you can hold off signing or announcing them until later in the month, you’ll be happy you did.â\u009c¨Mark down the best dates for your zodiac sign with your Taurus Monthly Horoscope! â\u009c¨Venus could bring applause and recognition to you until February 25 as she sparkles from her perch in your solar tenth house of achievement. After that, she dances into your solar eleventh house of friendship. Expect to be surrounded by many people who love and support you in the weeks ahead.February ends with a full moon in your solar fifth house of love, creativity, and fertility on the twenty-seventh. This luminary will surely light your heart on fire and bring you the chance to fall more deeply in love with a current partner or find someone new.Standout days: 13, 24, 27Challenging days: 1, 10, 19",
      "matches": [
        10,
        6,
        7
      ],
      "ratings": [
        3,
        4,
        2,
        4
      ],
      "money": []
    },
    "year": {
      "text": "\nWelcome to a brand-new year ahead of you, Taurus! There's a ton of unpacking you have yet to do, and yet you do not even know where to fully begin. You've been experiencing the lessons of having the planet of chaos charging through your sign with both glimpses in 2018 and moving full-on in 2019. However, this year adds a bit of strife to this energy.\n\nUranus does not like constraints under any circumstances, and as Saturn opens the year strongly situated in fellow fixed sign Aquarius, you could find yourself in a continual crossroads. In fact, this is the overall energy of your year. Feeling like you are moving forward and being yanked into place having to wait for changes to take their full effect. You might see through things so much that at times, it might even anger you. This year requires a great deal of maturity and patience on your part. Yes, there can feel like great losses, mainly not through your own undoing, but through the continual clash between Saturn in the Water-bearing Aquarius and outer-body Uranus in your sign.\n\nThe year's lunar cycles are eye-opening in your personal zones of self-acceptance and spiritual growth. The May 26 total lunar eclipse in Sagittarius does shed light on those areas of your life that you've tried to sweep under the rug. Understand that eclipses are galvanizing energy that truly wants you to get real with yourself so that you may heal from this situation. The annual solar eclipse in Gemini on June 10 can add some clarity to your overall financial destiny—also reflected with a partial lunar eclipse in your sign of the Bull on November 19. Then luckily, you'll feel the weight off your shoulders on December 4 as the total solar eclipse sees you revisiting certain events and scenarios around your karmic connections, this time with a renewed sense of self.\n",
      "matches": [],
      "ratings": [],
      "money": [],
      "love": [],
      "career": [],
      "wellness": []
    }
  },
  {
    "today": {
      "text": "Feb 4, 2021 - Machines are likely to pose a few problems today, Gemini, particularly where work and money are concerned. An unforeseen problem might interfere with your social life, perhaps forcing you to cancel a get-together you've been anticipating. If the person you were supposed to meet protests, avoid taking out your frustrations on him or her. Make new arrangements. It's only a temporary situation.",
      "matches": [
        1,
        7,
        10
      ],
      "ratings": [
        4,
        2,
        4,
        4
      ],
      "money": []
    },
    "yesterday": {
      "text": "Feb 3, 2021 - Today you can expect to have a highly interesting conversation with someone, Gemini. The person you will be talking to is going to provide you with a ton of information that will open a whole new world of knowledge. Excitement and happiness will be with you all day. This conversation will have an impact on your future.",
      "matches": [
        11,
        7,
        8
      ],
      "ratings": [
        3,
        4,
        2,
        4
      ],
      "money": []
    },
    "tomorrow": {
      "text": "Feb 5, 2021 - Plans for a social event that you were going to host in your home may have to be changed at the last minute. Even so, it should go very well. You're feeling exceptionally sociable now, Gemini, not to mention romantic and sexy. If you aren't presently involved, expect to meet more than one possibility. If you are involved, anticipate events that will bring you closer to your partner.",
      "matches": [
        12,
        7,
        9
      ],
      "ratings": [
        3,
        3,
        3,
        3
      ],
      "money": []
    },
    "week": {
      "text": "Feb 1, 2021 - Feb 7, 2021 - It’s time for adventure and wanderlust when Venus enters Aquarius on Monday. Venus enters your sector of philosophy, creating opportunities for travel and spurring you to make plans to explore the world.If traveling isn’t in the cards for you, get involved in education, studying other cultures and different points of view. This is an especially good time to start learning about different social issues and broadening your knowledge of diverse topics. Expand your horizons, Gemini.However, as you continue learning and exploring, you might come across some unpleasant things when Venus conjoins Saturn on Saturday. You may discover that you were completely wrong about an important issue, you could go on some misadventures, or you might lose a friend because of conflicting beliefs or points of view. While this can be a stressful period for your relationship, this is a good time to take a solo trip to clear your head and get centered. ",
      "love": "Feb 1, 2021 - Feb 7, 2021 - As loving Venus enters fellow air sign Aquarius at the beginning of the week, you feel comfortable just being friends. Love and passion can come later; right now, you just enjoy talking with someone you have a lot in common with.The Venus-Saturn conjunction late in the week has you questioning something you always believed to be the truth. If someone hurts you during this aspect, you aren’t likely to soon forget it.There’s an exciting Venus-Uranus square over the weekend that dares you to do something outrageous. Go for it, Gemini. As long as you know the potential consequences, there’s no reason not to have some fun.",
      "career": "Feb 1, 2021 - Feb 7, 2021 - If you work for yourself, try not to lose confidence in your abilities. This period may coincide with events that cause you to lose faith in yourself. Keep stepping out of your comfort zone and you'll be fine. This period may bring some powerful dreams that contain valuable guidance, including fresh perspectives on career issues. Write them down. The cosmos encourages you to compromise in one awkward situation.",
      "wellness": "Feb 1, 2021 - Feb 7, 2021 - The cosmos is encouraging you to enjoy intimate moments with your lover. They're guaranteed to help you burn calories and make your heart beat faster! Be careful while out socializing, because you may overdo it. If you drink alcohol, keep yourself hydrated with plenty of fresh water.",
      "money": "Feb 1, 2021 - Feb 7, 2021 - If you've been feeling a little stuck lately, there's an aspect for that. It can bring you out of your shell as you rise to any occasion. The planets shake up what you have going on with your personal style, and ask you to think outside the box when it comes to your appearance. Setting yourself apart may mean the difference between making a great impression and having to go it alone.",
      "matches": [
        1,
        7,
        10
      ],
      "ratings": [
        4,
        2,
        4,
        4
      ]
    },
    "month": {
      "text": "February 2021 - February could feel especially slow for you, Gemini. This is because your ruler Mercury is fast asleep in a retrograde cycle until February 20. Even after he awakens, though, he will be groggily catching up to speed through the remaining days.Mighty Mars, the planet of drive, ignites your solar twelfth house of rest, encouraging you to lie low, rest, and recharge. Don’t let the slower pace stress you out. Instead, find ways to use the vibe to catch up on tasks or give yourself some much-needed TLC.A new moon in your solar ninth house of expansion appears on the eleventh, opening a doorway to you regarding an academic, immigration, travel, or publishing matter. If you’re presented with a contract, though, it wouldn’t be the ideal time to sign. If you’re pressed to, just note that whatever agreement you make may end up shifting later.On February 18, the roaring sun enters your solar tenth house of achievements for the month ahead. Venus joins our great luminary here on the twenty-fifth. This means that now and in the weeks ahead, you could find great professional opportunities coming your way. Recognition, applause, and awards are possible. If you seek to rise higher, use this planetary strength to your advantage.The month ends with a full moon in your solar fourth house of domesticity on the twenty-seventh, causing you to focus on your work\/life balance. Some Geminis could move at this time, decide it’s time to fix up their space, or need to deal with a family matter.Standout days: 8, 13, 21Challenging days: 10, 19, 20",
      "matches": [
        1,
        7,
        10
      ],
      "ratings": [
        4,
        2,
        4,
        4
      ],
      "money": []
    },
    "year": {
      "text": "\nThere’s for sure plenty to talk about this year, Gemini! 2021 is a highly stimulating year for your creative sign. You are able to feel more aligned with your highest good, and can even make some pretty fantastic new friends along the way. You might actually be the go-to person when things get a little rocky, mainly because you adjust so easily and quickly to things and are able to see the humor in almost any situation.\n\nAs the year begins with some confrontational squares between Jupiter in Aquarius and Uranus in Taurus, you'll get a beneficial wave of abundance headed your way even through some gritty energy. This is also true in mid-February, May, and late December for you as Saturn's transit through Aquarius squares Uranus in Taurus, causing some chaotic waves in the world.\n\nThis can be tough on others through much of the year; but because Saturn will be nicely angled towards your airy sign, it will be bringing you many insights and brilliant moments. This can be that time where you find yourself in a very powerful way. Expect the unexpected and be extremely grateful for the gifts you receive, because you deserve them!\n\nOne important piece of the 2021 puzzle is to really consider the transition period of your birthday months. You might be a little caught up during this year's Mercury retrograde cycles, which all take place in air signs. One of the most important for you occurs on May 29, following a transformative total lunar eclipse in your opposing sign of Sagittarius. This is a vibe that will definitely have you rethinking a lot of different pieces of the story. And although it can be a highly enlightening time when it comes to all aspects of your life, there is still much work to be done through the summer. Especially because you are also met with an annular solar eclipse on June 10—at the same time Mercury continues a tricky retrograde cycle in your sign until June 22.\n",
      "matches": [],
      "ratings": [],
      "money": [],
      "love": [],
      "career": [],
      "wellness": []
    }
  },
  {
    "today": {
      "text": "Feb 4, 2021 - Obstacles may arise in the course of your chores when machines break down and interfere with your efficiency. Your frustrations may cause you to want to yell and throw things. If you must blow your top, Cancer, do it in such a way as to avoid causing upset to others. Go for a workout or jog. The machines will be fixed and the situation will pass. Hang in there.",
      "matches": [
        1,
        8,
        10
      ],
      "ratings": [
        3,
        3,
        3,
        3
      ],
      "money": []
    },
    "yesterday": {
      "text": "Feb 3, 2021 - Your physical and mental energy are exceptionally strong right now, Cancer. If you're creative, you will want to put that energy into a project that means a lot to you. If you're athletic, you will probably want to get outside and play a game or go for a jog or cardio class. Bear in mind that much of this energy is nervous energy that burns out quickly. Pace yourself.",
      "matches": [
        2,
        8,
        11
      ],
      "ratings": [
        4,
        2,
        4,
        4
      ],
      "money": []
    },
    "tomorrow": {
      "text": "Feb 5, 2021 - An unexpected letter or call could totally turn your working situation in a new direction. This can be disconcerting, Cancer, but it's a very positive and fortunate development. Relations with colleagues should involve new respect and enthusiasm. By the end of the day, you will likely feel very good about the way your life is going. Don't expect it to be the same as it was this morning!",
      "matches": [
        1,
        8,
        9
      ],
      "ratings": [
        4,
        4,
        4,
        3
      ],
      "money": []
    },
    "week": {
      "text": "Feb 1, 2021 - Feb 7, 2021 - Your February begins on a very intimate note when Venus enters Aquarius on Monday. With the planet of love, beauty, and attraction in your zone of intimacy, expect things to get very intense very quickly! Your current relationship might transform in a new, unconventional way. If you’re currently single, you could fall in love with a rebellious sweetheart. You could also form strong bonds with others in unique ways over the next few weeks. It’s sure to be a wild time!Your finances will be going through a transformation within the next couple of weeks as well. If you’ve been sharing money with someone—a joint checking account, a loan, living as a dependent—you may soon become financially independent.However, the week ends on a sour note when Venus conjoins Saturn on Saturday, making you resistant to change, which could hurt you financially. Allow yourself to let the past go, Cancer. ",
      "love": "Feb 1, 2021 - Feb 7, 2021 - You like to be the one who controls things during the sun-Mars square at the start of the week, but don’t decline someone’s invitation just because you â\u0080\u009cfeel like it.â\u0080\u009d Pettiness and dating don’t mix now.Romantic Venus leaves strict Capricorn for more easygoing Aquarius early in the week as well, opening you up to experimentation and innovation. If the way you â\u0080\u009cusuallyâ\u0080\u009d do things isn’t working, try another way.There are surprises during the Venus-Uranus square over the weekend that you probably won’t be ready for, which could put you in a difficult position. Should you go through with a date even if you aren’t totally comfortable? Probably not.",
      "career": "Feb 1, 2021 - Feb 7, 2021 - You seem to be extremely focused on harnessing your creative abilities and using them to explore new ideas and projects. You have a natural ability as a counselor and psychic. You may be thinking about making use of these skills to create new streams of income, or perhaps a whole new career. People come to you for help and go away as very happy and satisfied customers. This will boost your confidence.",
      "wellness": "Feb 1, 2021 - Feb 7, 2021 - If you have to arrange doctor's appointments or you're waiting for test results, watch out for mixed messages and confusion. It's worth double-checking all information. There's a greater than normal chance of mistakes. Take the time to relax in order to have the energy to handle any challenge that comes your way.",
      "money": "Feb 1, 2021 - Feb 7, 2021 - With an emphasis on past lives and karma now, it's imperative that you behave with decorum and politeness, particularly because things could be a bit unstable and unpredictable. Meanwhile, your romantic situation, family life, and ability to have fun are impacted. You're a clever sort. Don't risk long-term security for short-term enjoyment or you may suffer the consequences. And you don't want that.",
      "matches": [
        1,
        8,
        10
      ],
      "ratings": [
        3,
        3,
        3,
        3
      ]
    },
    "month": {
      "text": "February 2021 - As mighty Mars ignites your solar eleventh house of community, you’ll feel your social life highly active this month. This will likely bring exciting news from friends as well as possibilities for events and gatherings. If you’re able to make some time for fun and adventure, go for it. You’ll be glad you did!Venus glides into your solar eighth house of intimacy on February 1 and remains here until February 25, which can increase your need for affection and sensuality.â\u009c¨Mark down the best dates for your zodiac sign with your Cancer Monthly Horoscope! â\u009c¨A new moon in this same sector on the eleventh could help you grow closer in a relationship or else walk away once and for all. If you’re applying for financial assistance, a scholarship, or a loan, it could now arrive. However, Mercury is retrograde until February 20, so be careful about making any hasty agreements or decisions this month.The sun moves into your solar ninth house of expansion on the eighteenth, enticing you to seek new horizons in the month ahead. Some Cancers could become deeply focused on an academic, immigration, publishing, or travel plan that helps them feel like they’re breaking into new territory.As the month draws to a close, a full moon in your solar third house of communication could see you launching an important message around February 27. This could be a culmination regarding a writing, speaking, or marketing endeavor. Use your voice now because people will listen to what you have to say.Standout days: 22, 23, 24Challenging days: 10, 17, 19",
      "matches": [
        1,
        8,
        10
      ],
      "ratings": [
        3,
        3,
        3,
        3
      ],
      "money": []
    },
    "year": {
      "text": "\nYou are here for a major reason, and 2021 is one of those years where you've got to surrender to the outcome. You made some incredible changes during 2020 and are making some real headway. There were many ups and downs that could have felt a little more traumatic than normal, especially for your compassionate sign of the Crab.\n\nThis year really serves as looking at your life from an outsider's perspective. You're able to take an observer’s perspective and might even consider diving into some deep self-reflection that you once shied away from. Working in several facets of spirituality, body care, research, and expanding your mind, in general, is what 2021 is all about. There is nothing too out-of-the-ordinary for you right now, as you might even be more interested in either paranormal or occult-type studies.\n\nYou are extremely tied to the cycles of the moon, who's nodes now cycle between Gemini in the north position and Sagittarius in the south position. You are working out karmic cycles through learning your own patterns in communication and understanding what stories you've been told for far too long. You might even be faced with the truth about a family situation that you once spent far too much time trying to resolve. Maybe you've sacrificed your own happiness for the good of your loved ones only to come to terms with what you really want for yourself.\n\nThis is a year where you can really step into your own independence and gain a little emotional space from the judgments of others. There's a refreshing tone to your life once you accept the truth about something you've been stuffing under the rug. 2021, in general, is a time for you to face the music, and see how special you really are! Stop being so hard on yourself, loving Cancer!\n",
      "matches": [],
      "ratings": [],
      "money": [],
      "love": [],
      "career": [],
      "wellness": []
    }
  },
  {
    "today": {
      "text": "Feb 4, 2021 - Payment for work you've performed may not come when expected, Leo, particularly if direct deposit is involved. The planetary energies today don't favor the smooth functioning of computers or other machines. This is a temporary setback and not worth stressing over. Don't give in to the temptation to lose your temper. All will be straightened out and your funds will be in their proper place.",
      "matches": [
        2,
        9,
        10
      ],
      "ratings": [
        4,
        4,
        4,
        3
      ],
      "money": []
    },
    "yesterday": {
      "text": "Feb 3, 2021 - A delivery could come to your house that you find very emotionally moving, Leo. Perhaps you've received a gift that represents a big sacrifice to the giver, and was all the more sincere for that. This could be on your mind for most of the day even though you have a lot to do. When thanking the giver, be warm and sincere but not too effusive. You don't want to embarrass your friend.",
      "matches": [
        2,
        9,
        11
      ],
      "ratings": [
        3,
        3,
        3,
        3
      ],
      "money": []
    },
    "tomorrow": {
      "text": "Feb 5, 2021 - For you, Leo, relationships with other people should be going so well that you feel more loved than ever. A new friend or perhaps an old one you haven't seen in a while could suddenly become a powerful part of your life. You're probably feeling exceptionally innovative and more likely to make a success of whatever new ideas you have. Prepare for a busy and satisfying day.",
      "matches": [
        1,
        7,
        10
      ],
      "ratings": [
        2,
        4,
        3,
        2
      ],
      "money": []
    },
    "week": {
      "text": "Feb 1, 2021 - Feb 7, 2021 - Venus entering Aquarius on Monday creates the perfect conditions for falling in love, Leo. That’s because Venus enters your sector of partnerships. If you’re single and ready to mingle, this is a great time to start dating because you may find your other half. Keep an open mind, and don’t rule out anyone who isn’t your â\u0080\u009ctype.â\u0080\u009d You could fall for someone completely unexpectedâ\u0080\u0094even a close friend.If you’re happily committed, your partnership may get stronger during this time as you continue to bond. Sincere gestures of love, such as making your partner their favorite breakfast or doing weird dances to make them laugh, help build that connection. Embrace the unpredictable.However, it’s not all roses this week. On Saturday, Venus conjoins Saturn, making relationships more competitive, or it could create some distance between you and your partner. Give one another space without detaching completely. ",
      "love": "Feb 1, 2021 - Feb 7, 2021 - In your mind, you’ve been patient long enough, so your frustrations during the sun-Mars square early in the week are understandable. Unfortunately, Leo, you can’t force someone to feel the same way about you that you do about them.Love goddess Venus leaves responsible Capricorn for air sign Aquarius around the same time, so any little changes you’re willing to make will work to your advantage. It’s easier to meet someone you can have fun with when you’re a little less traditional and conservative.There’s an unpredictable Venus-Uranus square over the weekend that brings changes your way whether you’re ready for them or not. Try not to get upset when things don’t go your way. Your hot temper isn’t attractive now. ",
      "career": "Feb 1, 2021 - Feb 7, 2021 - This is a lucky time for you to do what you enjoy most and make a positive impression at the same time. A co-worker may need you to step in and take charge. You may be feeling a bit lazy. The energy at work should be more relaxed and supportive of cooperative efforts. This is a positive time to get away. Expanding your horizons may lead to a new or better job offer.",
      "wellness": "Feb 1, 2021 - Feb 7, 2021 - Certain symptoms could make a temporary reappearance before fading away. It's important to keep your system clear of toxins, especially now. You'll also benefit from releasing toxic emotions. These, too, can have a harmful effect on your health. You're about to discover the secret of high energy all the time.",
      "money": "Feb 1, 2021 - Feb 7, 2021 - This week you need to make an important choice. Forces want you to communicate for a living and incorporate more writing, speaking, teaching, and learning into your job. At the same time, new energy comes to your social sector, perhaps shaking up your groups and memberships. The remaining people may be the ones who supported you anyway. Cash comes when you're true to yourself and your goals.",
      "matches": [
        2,
        9,
        10
      ],
      "ratings": [
        4,
        4,
        4,
        3
      ]
    },
    "month": {
      "text": "February 2021 - Your career will be shooting off fireworks in February, Leo! Mars is skyrocketing through your solar tenth house of achievement, which can make this a tremendously exciting time for you to pursue professional goals. Set important meetings with business associates, pitch your plans, or search for a higher-paying job. Promotions, accolades, and public recognition may manifest now from previously completed work.However, this month could also bring some delays and confusion with a Mercury retrograde that lasts until February 20. If you can postpone signing contracts or making agreements until after that time, you’ll be happy you did.A lot of your attention may be focused on partnerships this month with the sun, Mercury, Venus, Jupiter, and Saturn in your solar seventh house. This bodes well for growing closer to someone, discussing ways to improve your union, or even finding someone with long-term potential if you’re single. The new moon on the eleventh is the best time of the year to do so because it may open a doorway here for you.However, as mentioned previously, it would be best to wait until later in the month before signing on the dotted line. This month is a great time to focus on pleasure, romance, and finding harmony in all of your connections.As you near the end of the month, a full moon in your solar second house of finance rises in the night of February 27. This might bring news of a raise, lucrative new client, or higher-paying job. With the Mercury retrograde over, you can sign contracts now and be confident they will last.Standout days: 14, 26, 27Challenging days: 17, 19, 23",
      "matches": [
        2,
        9,
        10
      ],
      "ratings": [
        4,
        4,
        4,
        3
      ],
      "money": []
    },
    "year": {
      "text": "\nThis is a huge year for your exuberant sign, Leo! There is so much going on, that it is often hard to keep track of all the wonderful goodies in store for your sign of the Lion! A major component of this year is also learning how to let go and surrender to the unknown.\n\nThe theme for your fire sign is to have the patience to know that it will all end up exactly the way it is supposed to be! Along these lines, you are met with incredible tests of faith throughout 2021 that will leave you flabbergasted at how awesome it is to be yourself! There will be some emotional tests and energetic changes, but with your commanding presence, you'll be able to handle it all with ease.\n\nThe year begins with a strong mid-January square between Jupiter in your opposing sign of Aquarius and Uranus in fellow fixed sign Taurus, creating a challenging T-square energy in your chart. This isn't the easiest of configurations to deal with at all, requiring extreme self-care in many circumstances.\n\nThis T-square affects all realms of your life, and is also brought around again with the Saturn in Aquarius square to Uranus in Taurus, spanning a cosmic influence through mid-February, mid-June, and late December. These will be time periods where you'll face a ton of internal and external friction, and in many cases, can be a certain straw that breaks the camel’s back with respect to your career, relationships, and public life.\n\nFinally, this year’s lunar eclipses will also trigger some important cycles highlighting your personal zones of self-expression, professional relationships, and community development in May, June, November, and December.\n",
      "matches": [],
      "ratings": [],
      "money": [],
      "love": [],
      "career": [],
      "wellness": []
    }
  },
  {
    "today": {
      "text": "Feb 4, 2021 - Family members might not be in the best of moods today, Virgo. Frustration with machines or friends could have tempers on edge, so try to avoid the temptation to get into arguments. The problems will be resolved and the bad moods will pass. You don't want any residual bad feelings between you and them. This is a good day to get out and spend the day in the bookstore by yourself.",
      "matches": [
        2,
        8,
        11
      ],
      "ratings": [
        2,
        4,
        3,
        2
      ],
      "money": []
    },
    "yesterday": {
      "text": "Feb 3, 2021 - A friend might drop by and want you to keep them company while they runs errands, Virgo. This might be a good idea, not only for the diversion from routine but also because something might happen in the course of these short journeys that points you in a new and very positive direction. Your mind could suddenly be flooded with ideas. Make the most of it.",
      "matches": [
        3,
        10,
        11
      ],
      "ratings": [
        4,
        4,
        4,
        3
      ],
      "money": []
    },
    "tomorrow": {
      "text": "Feb 5, 2021 - An unexpected opportunity could temporarily throw your life into disorder, Virgo, but you will see from the start that this is a definite stroke of good luck that you shouldn't let pass. It could involve money, a chance to move to your dream home, or relationships in some way. Whatever it is, you're definitely going to be happy about it.",
      "matches": [
        3,
        9,
        12
      ],
      "ratings": [
        3,
        3,
        4,
        2
      ],
      "money": []
    },
    "week": {
      "text": "Feb 1, 2021 - Feb 7, 2021 - The first week of February becomes quiet hectic for you when Venus enters Aquarius and your sector of work and routine on Monday. Your habits or carefully laid plans could turn completely upside down.Your skincare routine could get completely out of whack, or you might have to take on more responsibilities, like becoming a caretaker in a relationship. Unexpected events could also disrupt your money flow. In any case, you’d better hold on tight. It’s going to be a wild ride for the next couple of weeks.It doesn’t get much easier for the rest of the week. On Saturday, Venus conjoins Saturn to bring even more unpredictability into your life, especially in the area of love and finances. To cope, you might be tempted to detach yourself from the situation and grow distant and unemotional. However, try to stay present. This is all part of teaching you an important lesson. ",
      "love": "Feb 1, 2021 - Feb 7, 2021 - Were you getting along well with someone new until early this week? Blame it on the sun-Mars square that tends to cause tension and bring out differences. This, too, will pass, but it might be too late to salvage anything once the damage is done.The partnership of Venus and Aquarius starts early this week as well, and this humanitarian vibe is ideal for meeting someone you connect with when you’re helping other people. Volunteering your time at your favorite charity could be a big win\/win situation for you both!You’re focused on getting ahead during the Venus-Saturn conjunction late in the week, so you’ll probably be looking for someone who shares your strong work ethic. Try to talk about other things besides your career on a first date.",
      "career": "Feb 1, 2021 - Feb 7, 2021 - You could have some reason to feel proud now. You have a knack for finding ways to take care of yourself and your family even in tough times. A situation may challenge you to move in a more independent direction. Pause to review past actions and make some plans for the months ahead. The more specific you are about what you want, the better your chances of success.",
      "wellness": "Feb 1, 2021 - Feb 7, 2021 - Don't be too hard on yourself regarding your health. If you feel tired, focus on nurturing yourself in a way that encourages increased energy and inner peace. If you're pushing too hard to maintain a punishing schedule, you'll do yourself more harm than good. You might be motivated to research new options on your path to wellness. Every little bit helps.",
      "money": "Feb 1, 2021 - Feb 7, 2021 - This week, you have positive and negative news about your financial life. If you've been true to your goals and kept within budget, this planet provides new opportunities to make more money. If you've overspent, sudden and perhaps unexpected changes in your career sector could mean that what you counted on to cover bills may not be there. Saving for the future can get you through this time.",
      "matches": [
        2,
        8,
        11
      ],
      "ratings": [
        2,
        4,
        3,
        2
      ]
    },
    "month": {
      "text": "February 2021 - With so much activity in your solar sixth house of productivity, it’s clear that you have many irons in the fire! This bodes well for Virgos who are looking for work or interested in taking on more projects with their current employer.Venus, planet of harmony, enters this sector on February 1 and remains here until February 25. Laughter, creativity, and camaraderie could fill your workplace as you enjoy time with co-workers and clients more than usual.â\u009c¨Mark down the best dates for your zodiac sign with your Virgo Monthly Horoscope! â\u009c¨The new moon on the eleventh could bring a new job your way or more tasks across your desk. If you work hard on them now, you can truly impress your boss or other authority figures as you continue your climb to the top. This same sphere also connects to your diet, fitness, and health regimen, so if you’d like to improve anything in these areas, this is a good time to start new patterns.However, your ruler Mercury is retrograde until February 20, which is sure to bring a slower pace to life, and you could feel like you’re hitting snags everywhere you go. If possible, try not to sign contracts until after this cycle. However, sometimes you need to strike while the iron is hot in order to grab an opportunity. Just note that if you do sign an agreement, it might need to shift later down the road.On the eighteenth, the sun ignites your solar seventh house of partnerships. Venus dances into this same arena beginning on February 25. This foretells happy relationships and an opportunity to grow closer to a significant other. Single Virgos could be in luck to attract someone with long-term potential.The month ends with a full moon in your sign on the twenty-seventh, which could put you in the spotlight and likely bring a heartfelt goal within your grasp.Standout days: 8, 13, 27Challenging days: 10, 20, 26",
      "matches": [
        2,
        8,
        11
      ],
      "ratings": [
        2,
        4,
        3,
        2
      ],
      "money": []
    },
    "year": {
      "text": "\nThis is a major career year for your sign, Virgo. Your analytical self will enjoy the hard work and dedication it takes to make your dreams become a reality, but you also get a little boost of love from the cosmic cycles as well. You've done a lot of good deeds for so many people that it's kind of your time to let some good be returned to you as well. The only problem is sitting still and letting yourself have some fun along the way!\n\nA major aspect this year is your tenth house and fourth house being influenced by the current nodal transits as well as the lunar eclipses. The moon’s north node of fate transits through Gemini and sits high in your zone of career development, asking you to enjoy life a little more even as you are often obsessed with staying in control. The south node in Sagittarius asks you to let go of what no longer serves your soul and wants you to let go of any false narratives that have held you back.\n\nMore specifically, your energy is tied to the May 26 total lunar eclipse, the June 10 annular solar eclipse, the November 19 partial lunar eclipse, and the December 4 total solar eclipse. These dates can help you set a schedule and look at the actual patterns unfolding in your life at these specific times. You're going to be challenged to the max, but you will find your way through your own destined path. Your earthy sign is being given a lot of chances to prove yourself this year, as you are meant to fully thrive in all realms of life, love, and business.\n",
      "matches": [],
      "ratings": [],
      "money": [],
      "love": [],
      "career": [],
      "wellness": []
    }
  },
  {
    "today": {
      "text": "Feb 4, 2021 - Problems in your community may result from malfunctioning machines. Be prepared, Libra. Have flashlights handy in case of a power outage, and walk instead of drive in case signals cause major traffic jams. Neighbors may be going crazy, but try to stay calm. This is a temporary situation, and not worth getting all stressed over. A good piece of advice is to spend the day reading.",
      "matches": [
        4,
        10,
        1
      ],
      "ratings": [
        3,
        3,
        4,
        2
      ],
      "money": []
    },
    "yesterday": {
      "text": "Feb 3, 2021 - Paperwork regarding money might take up a lot of your time today, Libra. This can be tedious, but it's something that can make a very positive difference to you, and therefore needs to be handled as soon as possible. Try to stay focused, and don't forget to ask for clarification when you need it. In the evening, celebrate by going out on the town with a group of friends.",
      "matches": [
        3,
        9,
        12
      ],
      "ratings": [
        2,
        4,
        3,
        2
      ],
      "money": []
    },
    "tomorrow": {
      "text": "Feb 5, 2021 - A lot of letters, calls, and other communications could skyrocket you into a new and unexpected space, Libra. If you've been thinking of trying your hand at writing or speaking, this is the day to work on it. All signs indicate good fortune will come your way at this time, though it might sneak up on you and leave you a bit disconcerted. Pull yourself together and go for it.",
      "matches": [
        5,
        11,
        2
      ],
      "ratings": [
        2,
        3,
        4,
        2
      ],
      "money": []
    },
    "week": {
      "text": "Feb 1, 2021 - Feb 7, 2021 - Let the good times roll, Libra! You’re ready to take a walk on the wild side this week when Venus enters Aquarius on Monday, increasing the Aquarius stellium.This stellium is happening in your sector of pleasure, so let out your inner rebel for the next two weeks. Go ahead and redecorate your home, paint weird pictures, get kinky! There are no rules! It’s a moment of self-expression. Find ways of showing off who you are by drawing, writing, painting, taking pictures, whatever makes you feel most like you.Because this is a very â\u0080\u009cmeâ\u0080\u009d moment, make sure you create boundaries with people, especially when Venus conjoins Saturn on Saturday. Some people in your life may become too clingy, throwing you off balance. Express your independence. You don’t owe anyone a thing. Focus on what brings you pleasure, not on what people expect of you or what brings them pleasure. ",
      "love": "Feb 1, 2021 - Feb 7, 2021 - Passion is in the air during the sun-Mars square at the start of the week, but it might be misguided. You’re attracted to people who you know aren’t the best match for you, but it’s very hard to fight chemistry.Love has a more easygoing vibe when Venus leaves restrictive Capricorn and enters airy Aquarius in the beginning of the week as well, so you will be open to things that you usually aren’t. Experiment until it feels right!There’s a very serious Venus-Saturn conjunction at the end of the week that could have you looking for love in all the wrong places. Do you really want to date someone just because they could be good for your career or social status? Consider your motives more carefully, Libra.",
      "career": "Feb 1, 2021 - Feb 7, 2021 - You may be coping with a flurry of responsibilities now. Your usual way of relating to people could somehow fall flat. Try not to take this personally. The energy improves relations with co-workers and customers. There can be unexpectedly positive results if you go out of your way to be helpful. The energy is powerful for making a resolution for a better future. Tough times don't last forever.",
      "wellness": "Feb 1, 2021 - Feb 7, 2021 - Your health is emphasized now. If you love food, you may be enjoying the variety that's available during this season. Fortunately, you may also be in the mood to exercise and enjoy it. Perhaps you've picked up the exercise habit lately and discovered that it makes you feel fantastic. Keep it up!",
      "money": "Feb 1, 2021 - Feb 7, 2021 - It's a week of contradictions for you. Aspects are allowing you to become more confident in who you are and how you put yourself into the world. As your doubts disappear, you can focus on what really matters. Spending on family, romance, and children isn't a bad thing unless it pulls you wildly off course. Sticking to a budget shows how much you care.",
      "matches": [
        4,
        10,
        1
      ],
      "ratings": [
        3,
        3,
        4,
        2
      ]
    },
    "month": {
      "text": "February 2021 - The stars sparkle divinely for you in February, Libra. Get ready to open your heart wide as the planets rain showers of love upon you!On February 1, Venus dances through your solar fifth house of romance and creativity and remains here until February 25, bringing all Libras luck in matters of the heart. A new moon in this sector on the eleventh opens a doorway for you to welcome in more passion with a current partner or else find someone who truly aligns with your spirit.However, there is also the possibility of confusion in your love life this month because Mercury is retrograde until February 20. Some Libras may hear from someone from the past or consider reaching out to an ex. If you’d like to, go for it in the early part of the month. If you’re suddenly feeling uncertain about where you stand with a lover, or you sense that you aren’t on the same page, this would be a good time to review and reevaluate your interactions. Take the time to patiently discuss where each of you is coming from.The sun blazes into your solar sixth house of productivity on the eighteenth, promising a very busy pace of work in the weeks ahead. Venus also swirls forward into this same sector beginning on February 25, assuring pleasant relations with co-workers and clients.However, as you near the end of the month, a full moon in your solar twelfth house appears on the twenty-seventh. This luminary encourages you to rest, recharge, and lie low. Do so now while you can before work picks back up!Standout days: 1, 11, 14Challenging days: 6, 20, 27",
      "matches": [
        4,
        10,
        1
      ],
      "ratings": [
        3,
        3,
        4,
        2
      ],
      "money": []
    },
    "year": {
      "text": "\nWow, what a year you truly have in store for yourself, Libra! 2021 emphasizes your true gift of communication bringing out the more creative qualities of your sign. You might even consider focusing your attention on your more artistic and altruistic forms of expression. As an air sign, you find yourself on a quest for knowledge and might even consider entering a program of study that expands your understanding of various subjects.\n\nThe north node's transit through Gemini directs your personal magnetism towards continued education, spiritual expansion, and even connects you to communities around the world. You might even consider directing your energy towards more humanitarian causes as Saturn's presence in Aquarius trines your sign and connects you to several causes that you feel most passionate about.\n\nYou are a sign that seeks diplomacy and justice, which you know does not happen overnight. You are willing to put in the time and effort to really see certain things through and know that this is a full-year process ahead. You might even consider volunteering your time with certain organizations, and find yourself continually inspired by the stories of others as you deepen your understanding and research within your community.\n\nA very enlightening lesson this year includes the cycles of Mercury retrograde, which are all in air signs. This begins with an Aquarian retrograde during the months of January and February, creating an editing period for your fifth house, affecting your children and creative talents. As Mercury retrograde asks us all to investigate things more deeply, this is also an important lesson for all your relationships.\n\nYou'll feel more challenged by a Gemini retrograde cycle from May through early July. This can be a bit tricky in your communication style, and bring unwanted confusion. The year also brings a healing Mercury retrograde in your sign of the Scales from late September through mid-November.\n\nIn general, there's a lot of activity in the second half of the year in terms of questions and resolutions involving love.\n",
      "matches": [],
      "ratings": [],
      "money": [],
      "love": [],
      "career": [],
      "wellness": []
    }
  },
  {
    "today": {
      "text": "Feb 4, 2021 - Temporary upsets regarding money might result from a computer failure of some sort. Take care not to lose your temper over it, Scorpio. Instead, remain calm, focused, and polite until everything is worked out. Your financial condition itself still looks very promising. It's just that the planetary energies don't favor machines today, so they may all go out of whack. Hang in there.",
      "matches": [
        6,
        12,
        3
      ],
      "ratings": [
        2,
        3,
        4,
        2
      ],
      "money": []
    },
    "yesterday": {
      "text": "Feb 3, 2021 - A subject that fascinates you could occupy much of your time today, Scorpio. Questions may arise about this subject that you want answered now. Therefore, you could get into some in-depth research. This might have you trapped in the library or glued to the Internet until you either find what you want or pick up a few leads to places where you might find it.",
      "matches": [
        5,
        11,
        2
      ],
      "ratings": [
        3,
        3,
        4,
        2
      ],
      "money": []
    },
    "tomorrow": {
      "text": "Feb 5, 2021 - Good fortune continues to come your way, Scorpio, and your life may finally seem to be moving in the direction you wanted. Today, however, you may feel frustrated by a lot of minor, if somewhat bizarre, upsets. Dropping things, losing objects you just had in your hand, forgetting names - just about anything could happen. Try to see the humor in it and stay cool.",
      "matches": [
        5,
        11,
        3
      ],
      "ratings": [
        3,
        4,
        3,
        3
      ],
      "money": []
    },
    "week": {
      "text": "Feb 1, 2021 - Feb 7, 2021 - This month, you can expect the same old family drama. Sorry! Venus enters Aquarius and your family sector on Monday. They say home is where the heart is, but it can feel a little crowded when you have five planets in your home sector.When the planet of love and attraction is in this rebellious sign, your domestic life could become a little unpredictable, especially if you choose to follow your own path and stray from family traditions. Embrace your journey, Scorpio!However, tension comes to a head when Venus conjoins Saturn on Saturday. Your choice of romantic partner or a financial decision may not meet your family’s approval, creating some conflict. You might have to make a choice here: follow your heart or follow the traditional path. Don’t make this decision quickly or lightly. It could affect more things than you realize. Be smart. ",
      "love": "Feb 1, 2021 - Feb 7, 2021 - Your co-ruler Mars is involved in a square with the powerful sun at the beginning of the week, which could stir some pretty intense emotions. Thoughts of revenge are strong now, but you don’t have to act on them.The Venus-Saturn conjunction at the end of the week connects business with pleasure, which could lead to unwanted consequences. Focus on your career first and your love life second.The changes brought on by the Venus-Uranus square over the weekend catch you off guard and could cause you to feel uncomfortable or vulnerable, two of your least favorite things. You hate not being in control! ",
      "career": "Feb 1, 2021 - Feb 7, 2021 - Do your best to finish any outstanding assignments now. Spend some time focusing on little details, especially financial ones. The more you clear your workspace, the more effective you'll be in upcoming months. There could be clashes of temperament now. Someone may be feeling self-righteous while another person simply may not be taking a situation seriously. The energy brings a powerful opportunity to brainstorm about your career prospects.",
      "wellness": "Feb 1, 2021 - Feb 7, 2021 - You need to be physically and mentally on the ball to face up to certain challenges. If you don't want your blood pressure to rise, stay calm and develop the ability to be mentally detached. There's a chance of a new beginning, but it helps if you aim for a goal. Make your health a priority no matter what else is going on in your life.",
      "money": "Feb 1, 2021 - Feb 7, 2021 - Your money situation may not be quite what you want it to be now, but a helpful aspect boosts your morale this week. An emphasis on past lives and karma urges you to be careful about how you conduct yourself, especially when it comes to your words, which can seriously wound. Meanwhile, cash comes in when you exploit shared investments and properties.",
      "matches": [
        6,
        12,
        3
      ],
      "ratings": [
        2,
        3,
        4,
        2
      ]
    },
    "month": {
      "text": "February 2021 - A slower pace of life is guaranteed in February, Scorpio. This is because Mercury, planet of communication and clarity, is spinning backward until the twentieth. This could have you reassessing or reconsidering some plans regarding a home, real estate, or family matter. Despite some delays or uncertainty, a great deal of planetary energy can instead bring opportunities for growth and happiness to these same areas.Venus, planet of love, enters here on February 1 and remains until February 25, ensuring a more pleasant time at home and even giving you the inspiration to update your space if you’d like. More laughter and sweetness with family members can also occur.A new moon in this region occurs on the eleventh, likely bringing sudden movement regarding the domestic situations at the center of your mind. However, if you can hold off making any significant decisions until after February 20, you’ll be happy you did.The sun moves into your solar fifth house of romance on the eighteenth, soon to be joined by Venus, the planet of love, on the twenty-fifth. This could bring single Scorpios a dazzling opportunity to meet someone new or bring sensuality to those already committed.The month ends with a full moon in your solar eleventh house of friendship on February 27. An invitation to a lovely event or networking soiree is likely to come to you now. If you attend, you could be in tremendously high spirits.Standout days: 12, 27, 28Challenging days: 1, 2, 19",
      "matches": [
        6,
        12,
        3
      ],
      "ratings": [
        2,
        3,
        4,
        2
      ],
      "money": []
    },
    "year": {
      "text": "\nThis is an extremely important year for your powerful sign of the Scorpion. Several transits tug and pull at major points in your personal chart, bringing you brand-new perspectives, and also requiring you to implement decisions that contribute to both, your family and career life.\n\nThis combines several areas of your personal affairs and asks you to really look into your long-term arrangements from the perspective of a leader, caretaker, and healer. As 2021 brings along with it an influential square between Saturn in Aquarius and Uranus in your opposing sign of Taurus, this creates a prominent T-square in your own chart. This can be a difficult astrological energy most pointedly experienced during mid-February, mid-June, and the end of December, but leads to radical change in your overall life. There can be many unplanned events that ultimately decide your fate and affect your home and career situations. You might even consider moving for work, or relocating in some capacity.\n\nPluto, your home planet, enters a retrograde cycle through Capricorn between June 28 and October 7, making this timeframe a key zone to revisit what still needs to be accomplished in order to feel fully empowered and take back your personal authority in certain areas where you felt you lost your confidence. Some see you from the outside that have no idea what's been bubbling under the surface. Don’t lose sight of the big picture, and always remember that the universe wants you to succeed at anything you set your mind to, and this year is no exception to that rule.\n",
      "matches": [],
      "ratings": [],
      "money": [],
      "love": [],
      "career": [],
      "wellness": []
    }
  },
  {
    "today": {
      "text": "Feb 4, 2021 - Computers and other equipment could go haywire today, limiting your abilities to work at maximum efficiency. Even though you're usually calm and laid back, Sagittarius, today the ogre in you may be tempted to emerge. Don't let it. It will only cause tension between you and those around you. Stay calm and focused, call in a technician, and enjoy the break from your routine.",
      "matches": [
        6,
        12,
        4
      ],
      "ratings": [
        3,
        4,
        3,
        3
      ],
      "money": []
    },
    "yesterday": {
      "text": "Feb 3, 2021 - Emotions, impressions, and memories could come up from your subconscious today, Sagittarius. This may preoccupy you and keep you from other matters. This is a positive development. Pleasant memories bring joy. Disturbing ones offer a release from past trauma. Write down your thoughts and then distract yourself by doing something you love. The significance of this process should come later.",
      "matches": [
        7,
        1,
        4
      ],
      "ratings": [
        2,
        3,
        4,
        2
      ],
      "money": []
    },
    "tomorrow": {
      "text": "Feb 5, 2021 - All the planets are very fortunately aligned for you, and the coming weeks should be great, Sagittarius. Minor irritations today could make you wonder, though. You might worry that this good fortune won't last. Don't work yourself into a panic. This all continues through the next six months. However, you may need to focus sufficient effort if you'd like to make it last for a long time.",
      "matches": [
        5,
        12,
        2
      ],
      "ratings": [
        3,
        4,
        2,
        3
      ],
      "money": []
    },
    "week": {
      "text": "Feb 1, 2021 - Feb 7, 2021 - On Monday, Venus enters Aquarius and your sector of thinking and communication. It’s time to get logical about your financial situation, Sagittarius.While many associate Venus with love, the planet also controls how we spend money. You might suddenly get the impulse to do some redecorating, buy some fancy clothes, or take a trip. However, this wouldn’t be wise in the long term. Instead, start thinking about your current needs and goals for the next couple of weeks. It’s okay to take a short trip or buy something nice, just don’t blow your whole paycheck on it.Saturday could focus on sibling rivalry when Venus conjoins Saturn, creating some tension between you and your brothers or sisters. Instead of bickering, try to brainstorm and come up with a solution to your issues. It’s much easier to work together than to continue an argument that nobody can win. ",
      "love": "Feb 1, 2021 - Feb 7, 2021 - The sun-Mars square at the beginning of the week gives you confidence that could border on being egotistical. Being self-assured is a turn-on to some, but your huge ego could be a turnoff to others. Luckily for you, it will be easy to figure out the difference!When love goddess Venus partners with air sign Aquarius around the same time, your best matches are people who share your curiosity about the mysteries of the universe. A perfect first date would be watching a movie about outer space or having an in-depth talk about Area 51.The Venus-Uranus square over the weekend promotes change, which you usually enjoy, but unexpected news could really shock you. Trying to stay calm on the outside will be a challenge.",
      "career": "Feb 1, 2021 - Feb 7, 2021 - You could be frustrated now if you want to play and the people around you are serious and focused. Your strong need for freedom can cause conflict. The best use of your time is traveling for work or seeking expanded marketing or training opportunities. If necessary, just do your best and keep your opinions to yourself. This is a time when you may not be particularly productive. Things will improve soon.",
      "wellness": "Feb 1, 2021 - Feb 7, 2021 - Your routine could get a bit messed up, and you won't be able to prepare for the events that lie ahead. Your body may get out of sync, especially if circumstances don't work out as planned. If you can let go of the need for perfection, you'll experience a big release and feel much better inside and out.",
      "money": "Feb 1, 2021 - Feb 7, 2021 - A supportive aspect gives you a firm foundation upon which to build your money dreams. Another shakes up your close relationships and forces you to think about how each contributes to your life. If it isn't much, letting some go may be the ticket to greater happiness. Meanwhile, you get your ideas, products, and services out to a larger customer base. Success isn't far away.",
      "matches": [
        6,
        12,
        4
      ],
      "ratings": [
        3,
        4,
        3,
        3
      ]
    },
    "month": {
      "text": "February 2021 - Your mind could be especially active this month with so much planetary activity lighting up this area of your life, Sagittarius. Venus soars into your solar third house of communication on February 1 and remains here until February 25. This means that you can find the perfect words to charm anyone you want to impress.A new moon appears in this same arena on the eleventh, likely giving you the impetus to further explore a writing, speaking, advertising, or marketing initiative. Contracts often appear when a luminary like this takes place.However, despite the exciting and curious thoughts you may have now, a Mercury retrograde in this same zone occurs simultaneously and lasts until February 20. Despite your eagerness to write, speak, and connect, you may feel like you’re mired in miscommunication and delay. The best thing to do is use this time to brainstorm, journal, and strategize rather than agree to or announce anything. Later in the month, you’ll be far more favored.The sun moves into your solar fourth house of domesticity on the eighteenth, bringing you a deep urge to ground, center, and cozy up at home. Many Sagittarius can find more pleasure fixing up their space at the end of the month.Yet despite the urge to relax with family, a full moon in your solar tenth house of achievement appears on February 27. This luminary can ignite your name in the stars and bring a promotion, favorable press, or milestone achievement.Standout days: 7, 11, 14Challenging days: 5, 6, 27",
      "matches": [
        6,
        12,
        4
      ],
      "ratings": [
        3,
        4,
        3,
        3
      ],
      "money": []
    },
    "year": {
      "text": "\nWhat an absolute turning point kind of year 2021 will be for you, Sagittarius! There is a miraculous energy all around you that is quite refreshing for your benevolent sign of the Centaur. You will have times of massive self-reflection that can trigger old wounds, also met by extremely gracious moments of friendship!\n\nThe presence of the lunar and solar eclipses cycle through both, your personal sign and opposing realm of the Twins. This helps you get a full perspective and observe the world through a brand-new scope. You have various mass realizations this year that will set you on a successful course.\n\nThe May 26 total lunar eclipse in your sign, for example, provides a massive release in your personal life that is both purifying and strengthening. This can be an energetic blockage you've had for years that lifts and releases from your life. You may feel more exposed than normal, but that is the point of these shifts.\n\nLater on, as an illuminating annular solar eclipse in Gemini galvanizes your personal seventh house of partnerships on June 10, there is no place to hide! You are out and proud of whatever you believe in!\n\nThe goal this year is to get you expressing from a more heartfelt space. Appreciating life, and living it up is what it's all about these days. Even with the hardships of the world, your Jupiterian sign can really feel the love even through the tougher of times. The year concludes with a total solar eclipse in your sign on December 4, igniting your passions and bringing fruitful messages from the cosmic forces that be!\n",
      "matches": [],
      "ratings": [],
      "money": [],
      "love": [],
      "career": [],
      "wellness": []
    }
  },
  {
    "today": {
      "text": "Feb 4, 2021 - Don't try to sign up for a class over the phone or online today, Capricorn, as it probably won't work. This also isn't a good day to travel - delays are likely whether you fly or drive. If you've been planning a trip, don't finalize the arrangements now. Wait a few days, as computers and other equipment used in such arrangements are likely to malfunction, and you could end up frustrated.",
      "matches": [
        6,
        1,
        3
      ],
      "ratings": [
        3,
        4,
        2,
        3
      ],
      "money": []
    },
    "yesterday": {
      "text": "Feb 3, 2021 - Social events or group activities could prove more stimulating than usual, Capricorn. Discussions of every subject imaginable could take place around you, and you might have trouble deciding which ones you want to join. Your mind may be going the speed of light by the time the gathering ends. Walk home if time and weather permit. That should clear your head enough to let you sleep well.",
      "matches": [
        7,
        1,
        5
      ],
      "ratings": [
        3,
        4,
        3,
        3
      ],
      "money": []
    },
    "tomorrow": {
      "text": "Feb 5, 2021 - You may wonder why increased intuition has seemed to replace your usual logical self. An unexpected intellectual, spiritual, or metaphysical insight might come to you from another realm. It may seem so profound that you wonder if it really came from you. Write it down in detail. Whatever you come up with is going to keep you in the clouds all day, Capricorn. Don't trip or bump into anyone!",
      "matches": [
        7,
        1,
        4
      ],
      "ratings": [
        4,
        2,
        2,
        3
      ],
      "money": []
    },
    "week": {
      "text": "Feb 1, 2021 - Feb 7, 2021 - You had a good run with the planet of love in your sign, but on Monday, Venus leaves your sign in favor of sociable Aquarius and your sector of value. This could make you a little too focused on possessions and what you “own.”You could become obsessed with a romantic partner and reveal your jealous streak. Or you could become completely detached from romance and focus primarily on your finances and buying things. Either way, it’s not a great time for romance.And it doesn’t get much better when Venus conjoins Saturn on Saturday, creating even more distance between you and what you love as you seek financial stability. This would be an excellent day for some self-care. This is a time to create healthy boundaries and boost your self-esteem by acknowledging what is unique about you. Try it!",
      "love": "Feb 1, 2021 - Feb 7, 2021 - The sun-Mars square at the start of the week makes it tough for you to get to know someone better. When both of you insist on having control of the conversation, very little actually gets said.Venus exits your sign and partners with airy Aquarius around the same time, allowing you to see things from a new perspective. Is it possible you’ve been wrong about someone? Give them a second chance.There’s a Venus-Saturn conjunction late in the week that has you contemplating your future love life. Setting realistic goals now will help ensure that you end up where you want to be in six months, a year, and beyond.",
      "career": "Feb 1, 2021 - Feb 7, 2021 - You're likely to enjoy continued steady progress now. This is a positive time for teamwork. Your willingness to step in and help with a complex situation will be appreciated. Be cautious about your health. Limit your exposure to others and get plenty of sleep. The energy is powerful for pausing and setting some specific goals for the future. Don't underestimate your talents.",
      "wellness": "Feb 1, 2021 - Feb 7, 2021 - Stiffness in the joints could be an ongoing problem, especially if you're under pressure. You'll thrive by stretching to stay supple and keep your body as flexible as possible. There's going to be a tendency to indulge. You'll experience a tug of war between your mood and the need to eat comfort foods. Be aware of it.",
      "money": "Feb 1, 2021 - Feb 7, 2021 - It isn't enough to save now. You're clever, sometimes deceptively so, especially when it comes to money. Therefore, using this week's aspect becomes a prime directive. Advance your career aims while grabbing new opportunities in your working life. Just make sure your job is stable before investing your all into it. Sometimes things can change so quickly that the structure of a business can't keep up. Protect your interests at all costs.",
      "matches": [
        6,
        1,
        3
      ],
      "ratings": [
        3,
        4,
        2,
        3
      ]
    },
    "month": {
      "text": "February 2021 - February guarantees that your mind is highly focused on your income and prosperity, Capricorn. While you always like to build your life like a business, you’re especially favored to increase your abundance this month and throughout 2021.The sun, Mercury, Jupiter, and Saturn are already bringing attention to your solar second house, and Venus happily joins them as soon as the month begins. She remains here until February 25, and you could be a money magnet during this time!The new moon in this sector appears on the eleventh, perhaps bringing news of a raise, lucrative new client, or the offer of a better-paying job. Apply everywhere now if you’re looking for employment.However, despite this good fortune, Mercury is retrograde until February 20, which might slow down some of your progress. This could create some delays or confusion surrounding financial matters.The end of the month could cause a whirlwind of mental activity for you, though, as a full moon in your ninth house of expansion shimmers in the night of the twenty-seventh. This luminary brings a culmination to a media, academic, publishing, immigration, or travel matter. No matter what, you’ll be eager to soar in a fresh direction. If you’ve considered writing a book, this would be an excellent time to finalize your proposal and submit it to the right agency. If you’ve been looking to move overseas, a breakthrough concerning your visa could finally come your way.Standout days: 8, 9, 24Challenging days: 6, 7, 20",
      "matches": [
        6,
        1,
        3
      ],
      "ratings": [
        3,
        4,
        2,
        3
      ],
      "money": []
    },
    "year": {
      "text": "\nYou have woken up to a different version of yourself this year, Capricorn! You are a unique soul that is here for a welcoming purpose on this earth! The presence of your home planet Saturn through the sign of Aquarius is in full force this year, and has many lessons for your sign of the Goat to take in and process.\n\nThere is some element of psychology pulling at you, which requires you to be wise beyond your years. You are experiencing a new world for yourself, and might even long for things to go back to the way they were. But the innovative influence of Aquarius will have you feeling more emotionally detached from your partnerships and friendships, pulling you into the future!\n\nAs a sign who often puts work over love, this can be a little easier for those Goats who just want some energy to jump into their professional life with zero constraints. For those who are ignoring your relationship duties because work gets in the way, this is a year where you can truly come face-to-face in this respect, and be open about your feelings.\n\nThere is some pattern that needs to be reassessed in your overall life. The difficult square between Saturn in Aquarius and Uranus in Taurus takes you away from the original structure you once perceived to be the rules, and now asks you to be a little more radical and step out of your own way. The turning points this year are not limited to mid-February, mid-June, and late December, but do bring on these squares in strong. This is a lesson that will test your self-esteem, but that is meant to cleanse your second chakra of creativity.\n",
      "matches": [],
      "ratings": [],
      "money": [],
      "love": [],
      "career": [],
      "wellness": []
    }
  },
  {
    "today": {
      "text": "Feb 4, 2021 - No matter what friends tell you, Aquarius, this isn't the day to make an investment of any kind, from buying a house to starting a savings account. And this isn't a good day to invest online. The planetary energies don't favor computers or other forms of modern technology used in such transactions, so wait a day or two. Discussions about possibilities are OK. Just don't do it yet.",
      "matches": [
        8,
        2,
        5
      ],
      "ratings": [
        4,
        2,
        2,
        3
      ],
      "money": []
    },
    "yesterday": {
      "text": "Feb 3, 2021 - Your writing, speaking, and communicating skills are enhanced today, Aquarius. Therefore, you can expect to impress a lot of people around you who will change their opinion about you. People will express their sympathy openly, and you will feel integrated and accepted throughout the day. Tonight, find a bookstore that's sponsoring a lecture and go.",
      "matches": [
        7,
        2,
        4
      ],
      "ratings": [
        3,
        4,
        2,
        3
      ],
      "money": []
    },
    "tomorrow": {
      "text": "Feb 5, 2021 - You should feel especially sociable today, Aquarius. You might attend one or more events, or perhaps you will choose another type of group activity. Relationships of all kinds should prove satisfying and comforting. Expect to grow closer to the friends you have and meet new friends with whom you share many interests. You continue to meet professional, creative, and financial goals in a big way.",
      "matches": [
        8,
        2,
        5
      ],
      "ratings": [
        4,
        4,
        4,
        4
      ],
      "money": []
    },
    "week": {
      "text": "Feb 1, 2021 - Feb 7, 2021 - With the sun, Mercury, Jupiter, and Saturn in your sign and Venus entering your sign on Monday, you are stepping into your power this month. If you want something, this is the time to go for it. Invest in your passions because they’ll pay off in big ways.Venus will be in your sign for the next couple of weeks, making this the ideal time to focus on self-love. What makes you unique? What do you love about yourself? Start investing in your personal style by updating your wardrobe, changing your hairstyle, or stepping up your skincare game. Do whatever makes you feel good!However, you’re going to have to deal with some conflicting energies when Venus conjoins Saturn on Saturday and your rebellious impulses clash with your more discipled side. Try to create some healthy boundaries without coming across as cold and unemotional. Balance is the key here. ",
      "love": "Feb 1, 2021 - Feb 7, 2021 - The powerful sun-Mars square at the start of the week can bring out behaviors that you usually try to avoid. When the conversation between you and someone new gets heated, you’re more likely to bail than stick around and try to work it out.Romantic Venus also moves into your freedom-loving sign around the same time, so you’re totally happy being on your own. Being in a relationship just might not be your thing now, Aquarius, and that’s perfectly fine.Your home planet Uranus enters a square with Venus over the weekend, bringing some tumultuous times to your love life. You usually enjoy a challenge, but someone might seem like too much to put up with now. Luckily, you don’t have too much time invested.",
      "career": "Feb 1, 2021 - Feb 7, 2021 - This is an ideal time for travel and training to improve your career prospects. If you've been frustrated, network with others who share your interests. This can bring unexpected opportunities to move in a better direction. Be very honest. You may unintentionally exaggerate a situation calling for precise facts. Do your best to recognize people who have supported you through tough times. A work friendship may evolve into something more.",
      "wellness": "Feb 1, 2021 - Feb 7, 2021 - Take a look at your beliefs regarding your health. Some of them may be keeping you from enjoying the level of fitness you envision. If you tend to sabotage your own best interests, take a look at why you might be doing this. If you need a professional to help unravel the deeper causes, look for one. Once you understand your real motivations, you can take the right course of action.",
      "money": "Feb 1, 2021 - Feb 7, 2021 - You have a supportive aspect benefiting your curiosity in money issues. Your house of romance, kids, and family is highlighted Make sure you aren't spending too much to get or keep someone's love. Staying on budget may actually show more of your true loving nature. An emphasis on travel, spirituality, and learning shows that life lessons are just as important as possessions.",
      "matches": [
        8,
        2,
        5
      ],
      "ratings": [
        4,
        2,
        2,
        3
      ]
    },
    "month": {
      "text": "February 2021 - You are the cosmic favorite at this time, Aquarius! With so much planetary power in your zodiac sign, you have a rare opportunity to direct all events in your favor. The sun, Mercury, Jupiter, and Saturn have already been spinning within your grasp, highlighting your personal goals and plans. Venus joins you on February 1 and stays until February 25. With the goddess of pleasure within you, now is a great time to update your look or embrace romance.The new moon on the eleventh is the most important of the year for you because it puts your wishes and hopes front and center. In the coming week, be sure to take action to build the life of your dreams.However, despite all of this happy news, trickster planet Mercury is spinning backward in your zodiac sign until February 20. This can bring a much slower pace to everything around you and cause delays, miscommunication, and confusion. The best thing to do now is focus more on fun, relaxation, and strategizing rather than launching anything of significance. Once Mercury awakens at the end of the month, you can sign contracts, make announcements, and agree to partnerships.The final third of the month brings your finances into your awareness as the sun heats up your solar second house. With Venus making you a money magnet from the twenty-fifth on, you can have an easier time increasing your income. If you’d like to search for beautiful possessions, you’re also favored to do so then.Finally, to end the month, a full moon in your solar eighth house of shared assets appears on February 27. This luminary could bring news of the approval of a scholarship, loan, financial assistance, divorce settlement, or large payout if you’ve been waiting for it to arrive.Standout days: 8, 11, 12Challenging days: 1, 10, 17",
      "matches": [
        8,
        2,
        5
      ],
      "ratings": [
        4,
        2,
        2,
        3
      ],
      "money": []
    },
    "year": {
      "text": "\n2021 is the year to be an Aquarius! It is all about your ever-evolving sign that presents a unique and accepting perspective to the world at large. You are here to really provide inspiration to the planet as everyone around you seems to be super confused about where to turn next.\n\nYour Water-bearing sign is ready to embrace and fully appreciate the amazing vibration gifts the universe has in store! It is truly a time to ask your spirit guides for what you want, and find a surprise waiting for you around every corner!\n\nAs Saturn briefly entered your sign in 2020 experiencing a six-month retrograde cycle, you've gotten an idea of where you are headed this year. The structured planet is now transiting through your eccentric sign that enjoys the unknown twists and turns that bring forward many surprises and adventures.\n\nThe year is marked by some intense squares between Saturn in your sign and Uranus in the fellow fixed sign of Taurus. Because you are co-ruled by both of these two outer-bodies, this is going to be an exponential lesson for you.\n\nThere is a strong connection to time itself these days. You might feel throughout the year that time is either moving extremely fast or slowed down to a glacial pace. The most pointed squares being present on February 14, June 14, and December 24 will really test your sense of time in general. The entire purpose of this energy is to align you with your spiritual awareness and allow you to make decisions from your sense of intuitive awareness.\n",
      "matches": [],
      "ratings": [],
      "money": [],
      "love": [],
      "career": [],
      "wellness": []
    }
  },
  {
    "today": {
      "text": "Feb 4, 2021 - More than one problem with modern equipment could rear its head today, Pisces. Computers could malfunction, crash, or be maddeningly slow. You might also have a hard time reaching people you need to talk to. Don't be tempted to blow your top. That won't accomplish anything. Just call the technicians and get it handled. Tomorrow everything should be back to normal.",
      "matches": [
        9,
        3,
        6
      ],
      "ratings": [
        4,
        4,
        4,
        4
      ],
      "money": []
    },
    "yesterday": {
      "text": "Feb 3, 2021 - Correspondence with someone who lives far away could appear to lead to something more than friendship, Pisces. This person seems to be in total accord with you about nearly everything, and warm feelings could flow between you. However, if you haven't met in person, you should, at least before you get your hopes up for a relationship. It may be just what you've wanted - or it may not. Be careful.",
      "matches": [
        9,
        3,
        6
      ],
      "ratings": [
        4,
        2,
        2,
        3
      ],
      "money": []
    },
    "tomorrow": {
      "text": "Feb 5, 2021 - Today an important goal might reach a point you've been aiming at for a long time. All those in your entourage have new respect for you. In fact, Pisces, relationships of all kinds are warm, open, and honest, and you will probably enjoy the company of others immensely now. Romance, in particular, goes well. Feel free to indulge in a little celebration.",
      "matches": [
        10,
        4,
        7
      ],
      "ratings": [
        3,
        4,
        4,
        4
      ],
      "money": []
    },
    "week": {
      "text": "Feb 1, 2021 - Feb 7, 2021 - There’s a chill in the air and in your heart as Venus enters Aquarius on Monday, moving the planet of love into your sector of privacy.For the next couple of weeks, you might feel more distant from loved ones as you become more and more introverted. This is a period of aloofness as you work on your inner healing. It’s not a great time to be social or start a romantic relationship.Your need for privacy only intensifies when Venus conjoins Saturn on Saturday. You could become detached from reality, leaving your love life and financial situation up in the air. It’s okay to take some time out from the real world, but don’t go so deep into your own feelings that you forget everything else. Try looking for an outlet like journaling, making art, or talking to a professional to help you get out all of your subconscious emotions.",
      "love": "Feb 1, 2021 - Feb 7, 2021 - The duo of Venus in Aquarius at the start of the week doesn’t create a very romantic vibe, which could leave you feeling pretty sad and lonely. When your romantic actions go unnoticed, it leads to insecurity and self-doubt.The Venus-Saturn conjunction late in the week brings up a recent relationship fail, but try to look on the bright side. You can learn a lot by going over past mistakes and taking ownership of the things you did wrong.There’s a very unpredictable Venus-Uranus square over the weekend that can really turn your love life upside down. For a shy, introverted sign like you, this can be scary. Feel free to cancel plans if you’re uncomfortable.",
      "career": "Feb 1, 2021 - Feb 7, 2021 - You can help others get a lot done now. Offer your help to anyone who seems to be struggling. There could be some drama or conflict around you that's making everyone unhappy. Do your best not to make the situation more complex. There's a chance to cement a friendship with a co-worker. The energy is powerful for making a decision that creates a better balance between work and family responsibilities.",
      "wellness": "Feb 1, 2021 - Feb 7, 2021 - Talking is the best way to get issues sorted out now. You may tend to suffer from hidden tension even though you're smiling on the outside. Sometimes it's linked to partnership issues. If you can't talk directly to your partner, consider a counselor. You need the opportunity to share your troubles so your energy level stays high. Any kind of bodywork will help you release repressed feelings.",
      "money": "Feb 1, 2021 - Feb 7, 2021 - If money has troubled you recently, a healthy aspect helps you get out of that rut. Events are shaking up your home life and inner emotions. Feelings may seem to come out of nowhere. But it's all clearing the way for you to release old patterns so you can advance in your financial life. You're being urged to speak your mind at your job. Don't let someone else claim credit for your work.",
      "matches": [
        9,
        3,
        6
      ],
      "ratings": [
        4,
        4,
        4,
        4
      ]
    },
    "month": {
      "text": "February 2021 - With so much planetary activity in your solar twelfth house, it’s clear that you have a great deal of activity behind the scenes, Pisces. This could be increasing your intuitive senses or the intensity of your dreams. Pay attention to the messages from the universe now because you could have your finger on the pulse of some meaningful breakthroughs. This same sector of the sky also rules working on projects in private or developing things that will take some time to get right, so by all means let your creative juices flow and brainstorm!The new moon on February 11 could help you drum up some much-needed inspiration or even find more time to rest, recharge, and relax if you’ve been working too hard for too long.â\u009c¨Mark down the best dates for your zodiac sign with your Pisces Monthly Horoscope! â\u009c¨Mercury is retrograde this month until the twentieth as well, which can increase the lethargic feel and the likelihood of delays and stagnation. Don’t stress yourself out even if you feel this month is like walking through sludge. Trust the process. You are like a plant. You need your time to grow.The sun enters your zodiac sign on February 18, ringing the bell of your birthday season. In the weeks ahead, take steps to move toward your most important plans. Venus joins you on the twenty-fifth to bring you exceptional beauty, grace, and radiance.The end of the month turns your attention to your most important partner in love or business as a full moon in your solar seventh house appears on February 27. Use this luminary to help you grow closer or else clear the air.Standout days: 12, 13, 23Challenging days: 6, 17, 27",
      "matches": [
        9,
        3,
        6
      ],
      "ratings": [
        4,
        4,
        4,
        4
      ],
      "money": []
    },
    "year": {
      "text": "\nThere's a difficult energy to pin down this year, Pisces. You have to really take the approach of allowing life to come as it is for your sensitive sign of the Fish.\n\nThe most pivotal transit affecting your chart includes a series of eclipses between Gemini and Sagittarius that activate your personal tenth and fourth houses. These are more specifically your zones of career pursuits and family development. Whenever you feel like you are getting out-of-control this year, one strategy to take that will really help you is to always follow your grounded path.\n\nAs Uranus continues to break boundaries in Taurus, this outer planet is also met with a conflicting square with Saturn in Aquarius. This holds the element of extremes, especially in mid-February, mid-June, and late December; but sparks certain events that also affect your loving sign throughout the entirety of the year.\n\nYes, this energy will challenge you on many levels, especially through your personal realms of communication and psychic development. For those Pisces who are open to their gifts, this will be extremely easy for you, and for those who have suppressed your personal intuitive nature, this can feel a little overwhelming at times.\n\nYou are extremely in tune with the unseen world this year, and it can feel like you're able to predict things before they even happen! It is a good year to work with others that support you, and also share your gifts as well. During this fascinating year, your spiritual life might even deepen.\n",
      "matches": [],
      "ratings": [],
      "money": [],
      "love": [],
      "career": [],
      "wellness": []
    }
  }
]