[
  {
    "today": {
      "text": "Jan 28, 2021 - The approach of a very special visitor might cause you to thoroughly clean your house, Aries. Afterward, you could look for new and interesting ways to dress it up with some new plants, throw pillows, or other decorative touches. This can be tiresome, but definitely worthwhile. When your friend arrives, he or she will feel at home. Work hard and then make yourself look great.",
      "matches": [
        10,
        5,
        7
      ],
      "ratings": [
        3,
        3,
        2,
        3
      ],
      "money": []
    },
    "yesterday": {
      "text": "Jan 27, 2021 - This might be the perfect day to go out, Aries, or stay in and turn off the phone. Friends and relatives could be stressed, and phone conversations could touch off some misunderstandings and cause unnecessary hurt feelings. If you must talk to people, keep the conversations light and brief. You won't want to mar a nearly perfect day.",
      "matches": [
        9,
        5,
        6
      ],
      "ratings": [
        4,
        3,
        4,
        4
      ],
      "money": []
    },
    "tomorrow": {
      "text": "Jan 29, 2021 - Now that you've earned your place in the world after all your hard work, Aries, you might take some time to pursue your own interests. This could involve writing or publishing, going back to school to get an advanced degree, or taking a trip around the world. You have the time and energy to think about all your different options, so don't feel you have to rush.",
      "matches": [
        9,
        4,
        6
      ],
      "ratings": [
        3,
        4,
        3,
        2
      ],
      "money": []
    },
    "week": {
      "text": "Jan 25, 2021 - Jan 31, 2021 - On Tuesday, the sun in Aquarius squares Uranus in Taurus, creating some tension when it comes to wealth and ownership. You aren't into \"traditional\" ways of doing things, but maybe it's time to use your social connections to find new ways to make money.On Thursday, you're feeling lovely and energized when the full moon is in Leo. The moon is in your pleasure zone, making for a very entertaining night! Whether you're completing a creative project or sealing the deal on a love affair, you're coming into your power.Finally, on Saturday, Mercury retrogrades in Aquarius. This retrograde occurs in your friendship sector, creating some major tension in your social group. Watch out! The group chat is about to get heated, especially if politics come up. If you find yourself writing an impulsive text, just delete it instead of sending it. Thank us later. ",
      "love": "Jan 25, 2021 - Jan 31, 2021 - The sun is in independent Aquarius as it squares Uranus early in the week. You have your own thoughts now, and you don't mind speaking your mind about them. However, maybe disagreeing with someone you're trying to get to know better isn't the best first move!A midweek Leo full moon means that your confidence level is high, and you take pride in your talents and abilities. Your strengths are obvious during this fellow fire sign's lunation, which should put you on someone's radar.There's a lot to look forward to during the sun-Jupiter conjunction later in the week. What's your romantic fate? It might be revealed to you sooner than you think.",
      "career": "Jan 25, 2021 - Jan 31, 2021 - Put getting enough sleep at the top of your agenda. Illness is possible if you get too stressed. This could be a very productive period. Stick close to established procedures and your regular routine. This period can see you get pulled in many directions at once. It can also bring you to a crossroads. You may not change your goals, but you may think of a new way to get what you want.",
      "wellness": "Jan 25, 2021 - Jan 31, 2021 - You can do a lot to help yourself by watching for the first signs of stress and not getting tangled into emotional knots. There are powerful aspects around that could cause you to work even harder than usual and burn out. You'll suffer if you do this day after day. Don't push so hard. You could use a break before you reach the breaking point.",
      "money": "Jan 25, 2021 - Jan 31, 2021 - This week is about your home, which may mean having to spend more to get good quality goods or an emergency plumber to fix a broken sink. Whatever the case, know that it's going to be better soon. Meanwhile, a supportive aspect transforms your dreams. Don't give up on that wild scheme yet. It may yield results soon.",
      "matches": [
        10,
        5,
        7
      ],
      "ratings": [
        3,
        3,
        2,
        3
      ]
    },
    "month": {
      "text": "January 2021 - A new year begins with just a few days left with your ruler Mars powering up your solar first house of identity. You have harbored this mighty strength for the last six months, and it clearly moved you to take control of your life.However, beginning January 6, Mars enters your solar second house of finances where it remains for the next two months. In the coming weeks, you have the fighting power to streamline your accounting. This fuel will likely increase your expenses quite a bit during this time, but it also gives you a chance to make more through all of your gusto.?Mark down the best dates for your zodiac sign with your Aries Monthly Horoscope! ?Lovely Venus enters your solar eleventh house of communities on the eighth, adding more focus to the Aquarian stellium in the sky. This assures that you?ll hear from many friends in the several weeks to come and could even enjoy quite a bit of social activity.A new moon in your solar tenth house of achievement appears on January 13, opening a doorway in your professional life. In the coming days, a new project, promotion, or career opportunity is likely to arrive. Mercury begins to slow down midmonth, readying for an impending retrograde. Do your best to tie up all contractual matters now if you can.Finally, to end January, a roaring full moon in your solar fifth house of fertility will rock the night on the twenty-eighth. This luminary may signal a culmination with regard to love, creativity, or children. Embrace the many exciting vibrations, Aries! You will truly enjoy 2021.Standout days: 4, 13, 23Challenging days: 12, 14, 26",
      "matches": [
        10,
        5,
        7
      ],
      "ratings": [
        3,
        3,
        2,
        3
      ],
      "money": []
    },
    "year": {
      "text": "\nYou're a fire sign who's always ready for whatever challenges life brings, and this year is no different. Step up and conquer the world!You feed off the fast-paced energy from your dynamic power planet Mars and 2020 starts with this aggressive planet in Sagittarius, the sign of adventure and knowledge. World travel now is an amazingly eye-opening experience now, rich with valuable learning experiences. It will take another several months, until the end of June, until Mars reaches its most dominant placement in your sign, where it will stay for the next two months. Winning is your main objective and yes, you can be a sore loser!✨Reveal what 2021 has in the stars for you with your Yearly Horoscope! ✨The sun visits your sign from mid-March to mid-April, so happy birthday, courageous, inspirational Aries! Can you feel the anticipation building toward something amazing? You're in your element now, so for the next month you're a straight-up warrior (especially when it comes to competitions). You destroy anything in your path, and you enthusiastically push toward achieving your goals. Anyone who dares stand in your way now should watch out--you have zero patience for haters.Wounded Chiron is in your sign all year, causing a major identity crisis. Chiron challenges the very idea of what you believe in and are, and makes you wonder if you're on the right track to reaching your life's purpose. The worst of this transit could cause you to question if you even have a right to exist, but the Chiron retrograde cycle from early July to mid-December helps you reawaken the underlying Aries fire and understand why you've been undervaluing yourself so much. Embrace opportunities for spiritual healing now.\n",
      "matches": [],
      "ratings": [],
      "money": [],
      "love": [],
      "career": [],
      "wellness": []
    }
  },
  {
    "today": {
      "text": "Jan 28, 2021 - Romantic novels and movies could be more appealing than usual today, Taurus. You're in an especially intense mindset. If you're involved, your relationship could be near the point where it has to move ahead or end. Chances are it will move ahead. If you aren't attached, your loving nature will attract more than one potential partner into your aura. Be prepared, and expect the unexpected.",
      "matches": [
        10,
        5,
        7
      ],
      "ratings": [
        3,
        4,
        3,
        2
      ],
      "money": []
    },
    "yesterday": {
      "text": "Jan 27, 2021 - Recent stress could leave you wanting to spend the day shopping for items that may be nice but aren't really necessary, Taurus. This is fine, since you may want to spruce up your surroundings. Take care you don't go overboard, and be careful not to take home something that you wouldn't normally go for. You don't want to have to return an unwanted object to the store.",
      "matches": [
        11,
        6,
        8
      ],
      "ratings": [
        3,
        3,
        2,
        3
      ],
      "money": []
    },
    "tomorrow": {
      "text": "Jan 29, 2021 - Money that has come your way unexpectedly might have you thinking in terms of expanding your personal interests and holdings, Taurus. You might consider trying some new investments, particularly property. There's no need to rush to make a decision, however. You have all the time in the world to consider different options - and have some fun while you do it.",
      "matches": [
        11,
        5,
        8
      ],
      "ratings": [
        4,
        4,
        4,
        4
      ],
      "money": []
    },
    "week": {
      "text": "Jan 25, 2021 - Jan 31, 2021 - We're fully into Aquarius season, Taurus, and you might feel tempted to go off the beaten path as far as your career is concerned when the sun in Aquarius squares Uranus in your sign on Tuesday. Corporate world getting you down? While it's tempting to go rogue, hold off on making any major life decisions right now.Stay close to home when the full moon is in Leo on Thursday. The moon is in your domestic zone, bringing gratitude and energy to your home life. This is an excellent day to spend time with your loved ones and express thanks for having them in your life by cooking a meal, watching a movie, or creating something together.Finally, things go sideways when Mercury retrogrades in Aquarius on Saturday. Mercury reverses in your career sector, creating communication issues at work. Make sure to back up your technology and double-check all e-mails. ",
      "love": "Jan 25, 2021 - Jan 31, 2021 - There's a sun-Uranus square early in the week that involves a lot of quirky Aquarius energy. Your freedom is valuable now, so don't let anyone question your desire to stay single.The moon is full in fire sign Leo in the middle of the week, encouraging you to seek attention from people you're attracted to. Showing them one of your hidden talents should seal the deal!The desire to share your time with someone is strong during the Venus-Pluto conjunction about the same time. If you don't have anyone special in your life, intensify the search. ",
      "career": "Jan 25, 2021 - Jan 31, 2021 - You should enjoy a spirit of cooperation and harmony with co-workers now. Family concerns may be a distraction, so budget your time carefully. Other people can help fill in for you if you ask. The energy is lucky for making plans for the months ahead. Expect to feel a greater sense of optimism as any limitations and disappointments of the last few months begin to ease. Better days lie ahead!",
      "wellness": "Jan 25, 2021 - Jan 31, 2021 - Your health is in your hands now more than it has been for some time. It would be helpful if you understood the relationship between your fears, worries, and defenses you erect and the health problems that result. You're going to understand this relationship even more in the coming weeks. What you obsess over can be bad for your health.",
      "money": "Jan 25, 2021 - Jan 31, 2021 - If you want to make some changes to your work and money life, this is the week to do it. Your communication sector is expanding, giving you unique skills to get your point across to anyone, from the top of the food chain on down. At the same time, your social circle changes as you weed out the people who aren't serving you or your life's goals. Cash comes from following the dictates of your heart.",
      "matches": [
        10,
        5,
        7
      ],
      "ratings": [
        3,
        4,
        3,
        2
      ]
    },
    "month": {
      "text": "January 2021 - Prepare for a surge of energy and momentum, Taurus, because mighty Mars ignites your solar first house of identity beginning on January 6 and for the coming two months. You will have more fuel to tackle all of your heartfelt goals and plans.Also, with Jupiter and Saturn bringing extra strength to your career at this time, you could find that the approaching two months are major for rising higher than ever before. During the weeks ahead, you will be able to turn over a new leaf, be more hypnotic than usual, and assert yourself finally after nearly six months of being held back.?Mark down the best dates for your zodiac sign with your Taurus Monthly Horoscope! ?Lovely Venus enters your professional sector on the eighth, adding further luck to your path for the rest of the month.A new moon in your solar ninth house appears on January 12, opening a door for you to step toward new horizons. Some Taurus will soon begin movement on an academic, media, or international project at this time. Get ready to soar!Uranus, which has been in your zodiac sign since 2018, will awaken on the fourteenth, electrifying you for months to come to embrace more authenticity and power in all ways.However, be sure to sign contracts as soon as you can because Mercury will start to slow down for another retrograde that begins at the end of the month.Finally, to end January, a full moon takes place in your solar fourth house of home and family on January 28. This will bring a culmination regarding a living situation or require you to aid a family member in need. Jump on it now.Standout days: 9, 11, 20Challenging days: 8, 12, 30",
      "matches": [
        10,
        5,
        7
      ],
      "ratings": [
        3,
        4,
        3,
        2
      ],
      "money": []
    },
    "year": {
      "text": "\nYour love of the good life motivates you to accomplish some great things this year!Venus, goddess of love and money, is your ruler and as she starts the year out in experimental Aquarius (Venus in Pisces January 1), your mind opens to new ideas in both areas. You're more comfortable, though, when she enters your sign in early March until early April and then again in Libra (the other signs she rules) for about three weeks at the end of October. Pleasure and passion combine now to help you enjoy the finer things in life. The one retrograde period your ruler experiences is from mid-May to end of June, during her trip through curious Gemini, causing you to ponder the dualities of love and money. While you can't imagine living life without a lot of either, it's interesting to consider the alternatives.✨Reveal what 2021 has in the stars for you with your Yearly Horoscope! ✨The sun spends time in your comfort-conscious, earthy sign between mid-April and end of May, so happy birthday beautiful, loyal Taurus! You're ready to work hard in exchange for the pleasures that life has to offer--especially beauty and abundance. You don't have to apologize for loving beautiful things--this essential part of your nature is what drives you to succeed. Your senses are awakened now, and you fall in love with gourmet food, fine wine, expensive perfume, luxurious linens and beautiful artwork.And don't forget that Uranus, the planet of change, is moving along in your steady sign all year, causing upheaval in a lot of areas. Although it's only retrograded until January 10, it cycles back again to a retrograde cycle in mid-August until the end of the year. So, what this means for you, dear Taurus, is rolling with the changes. Not your forte but being as open-minded and flexible as possible will get you through some rough patches during this progressive transit.\n",
      "matches": [],
      "ratings": [],
      "money": [],
      "love": [],
      "career": [],
      "wellness": []
    }
  },
  {
    "today": {
      "text": "Jan 28, 2021 - Your financial situation could get a strong boost today, Gemini. This might be due to a contract you've just signed, perhaps involving some work you will do on your own rather than for an employer. The project may have strong personal significance. The creative arts could be involved, as well as technology. Be prepared for a busy month, but it will be a great one. Go for the gold!",
      "matches": [
        12,
        6,
        9
      ],
      "ratings": [
        4,
        4,
        4,
        4
      ],
      "money": []
    },
    "yesterday": {
      "text": "Jan 27, 2021 - Uninvited visitors could cause some stress, Gemini. You wanted to spend your day resting, but now you have to entertain people, and this could prove irritating. It's better to keep the visit short and sweet than feel obligated to play host when you aren't up to it. You will want to stay on good terms with your guests. Be polite but firm and then relax.",
      "matches": [
        11,
        6,
        8
      ],
      "ratings": [
        3,
        4,
        3,
        2
      ],
      "money": []
    },
    "tomorrow": {
      "text": "Jan 29, 2021 - You may feel so confident that you could be thinking in terms of starting a new enterprise, Gemini. Partnerships are especially likely to succeed now. You could also grow closer to those who mean the most to you - family, friends, romantic partners. If you aren't currently romantically involved, you might be soon. Your new sense of self-confidence should pull more people into your circle.",
      "matches": [
        11,
        5,
        8
      ],
      "ratings": [
        2,
        4,
        3,
        2
      ],
      "money": []
    },
    "week": {
      "text": "Jan 25, 2021 - Jan 31, 2021 - Take a baby step outside your comfort zone when the sun in Aquarius squares Uranus in Taurus on Tuesday. If the winter blues have got you feeling like a hermit, it might be time to go on a little adventure even if you are a bit nervous.Take a short trip when the full moon is in Leo on Thursday. Whether it?s a day trip or just a drive around the block, getting out of your current environment will help clear your mind and may help you think critically about certain issues that are bothering you.Get all your traveling done now because you?ll be homebound starting Saturday when Mercury retrogrades in Aquarius. The year?s first retrograde occurs in your philosophy sector, so expect issues and miscommunications with travel, education, and opinions. Cancelled travel plans, troubles at school, and changing your mind are all possibilities for the next couple of weeks. ",
      "love": "Jan 25, 2021 - Jan 31, 2021 - The sun is in Aquarius early in the week as it squares Uranus, the planet that rules the sign. As you're surrounded by a lot of kindred airy energy, don't hesitate to express your individuality.The full moon in fire sign Leo in the middle of the week can help you take things to the next level. If the chemistry between you and someone new is undeniable, what are you waiting for? Act on it!About the same time, a Venus-Pluto conjunction appears and intensifies your attraction to someone you might think is out of reach. Look for reassurance from your friends if you're unsure of your positive attributes. ",
      "career": "Jan 25, 2021 - Jan 31, 2021 - Finish all you can early in the day. Pay close attention to the financial details of any sale or purchase. Do your best to understand and stay within budgets. You're likely to be pulled in many directions. This need not be a problem if you're well prepared. This period brings an opportunity do some online research that can improve your prospects in the months ahead.",
      "wellness": "Jan 25, 2021 - Jan 31, 2021 - The cosmos is encouraging you to go outside and enjoy the feeling of the sunshine on your skin. This is one of the most enjoyable ways to get your daily dose of vitamin D, as long as you don't overdo it. It may also help to do a short cleansing diet. It will enable your body to get rid of toxins and give you plenty of extra energy.",
      "money": "Jan 25, 2021 - Jan 31, 2021 - This week you may be a lot more forgiving of your unconventional side, especially when it comes to words and ideas. Fun, family, and romance are foremost in your mind. But other aspects affect your personal expression. You're a bit unique now, but it's safe to relax into it. You know when to draw the line.",
      "matches": [
        12,
        6,
        9
      ],
      "ratings": [
        4,
        4,
        4,
        4
      ]
    },
    "month": {
      "text": "January 2021 - January will be a bit slower for you for a few different reasons, Gemini. Mighty Mars, the giver of strength, drive, and energy, will be residing in your solar twelfth house of rest and healing for the first two months of the year. This means that you could still be focusing on tying up matters from 2020 or even working on an important project behind the scenes.Despite this, your mind will be quite active with your ruler Mercury dancing with Venus through your solar ninth house of expansion. You could be restless for new horizons or even contemplate an area such as academics, media, or immigration.?Mark down the best dates for your zodiac sign with your Gemini Monthly Horoscope! ?A new moon in your solar eighth house of shared assets appears on January 12, filling you with the urge to merge. This will put a focus on partnerships, as well as if you?re having your needs met or you need to walk away. If you?ve been in search of a loan, scholarship, or venture capital, it may begin to move forward now.However, if you?re set to sign paperwork, which it looks like you will this month, do so soon because your ruler turns backward in the sky on the thirtieth. You will notice the slower pace as early as mid-January.To end this month, a full moon appears in your solar third house of communication on January 28, and this could see you launching an important writing or speaking project now. Be careful what you say and announce, though, because Mercury?s impending retrograde could cause some confusion.Standout days: 1, 8, 14Challenging days: 9, 13, 26",
      "matches": [
        12,
        6,
        9
      ],
      "ratings": [
        4,
        4,
        4,
        4
      ],
      "money": []
    },
    "year": {
      "text": "\nConnect with yourself and others on a higher level this year.Mercury is your ever-logical, perceptive ruler, and as one of the fastest moving planets it changes signs quickly. It seems like everyone's on the lookout for Mercury's dreaded retrograde cycles, and because it's your ruler, you should pay extra close attention. Not that you're going to let them slow you down too much, but this year the three periods between February 6 and March 9, June 17 and July 11, and October 13 and November 2 are all dates to be aware of. It's also important to note that all three retrogrades pass through emotional water signs, which advise you to slow down when dealing with the obstacles like miscommunications, misunderstandings and commuting mishaps. This will be challenging for you, Gemini, but you can do it.✨Reveal what 2021 has in the stars for you with your Yearly Horoscope! ✨The sun drifts through your airy sign from the end of May until the end of June, signifying a mentally alert time when you're able to communicate and exchange ideas freely. Happy birthday curious, perceptive Gemini! You're at your most perceptive now, so you'll notice things that others ignore. Mercury is also the planet that's linked to sibling relationships, and what better time to reconnect with a brother or sister than your birthday month? Whether you text each other several times a day or haven't seen one another in years, strengthening your bond is possible nowIt's time to tune in to details at the end of August as the sun enters Virgo, the other sign that Mercury governs. Health issues will be key now, too, especially stomach\/intestinal issues, which you should tend to quickly. Listen to your body and at the very least get a physical to rule out more serious ailments.\n",
      "matches": [],
      "ratings": [],
      "money": [],
      "love": [],
      "career": [],
      "wellness": []
    }
  },
  {
    "today": {
      "text": "Jan 28, 2021 - Today you may decide to study healing, Cancer. You could read about alternative methods regarding diet, herbs, aromatherapy, massage, or acupuncture. You might decide to learn some hands-on methods. Whether or not you ever practice any of these professionally, learning about them should transform your life for the better on both physical and emotional levels. Make the most of it.",
      "matches": [
        12,
        6,
        9
      ],
      "ratings": [
        2,
        4,
        3,
        2
      ],
      "money": []
    },
    "yesterday": {
      "text": "Jan 27, 2021 - Some callous words spoken carelessly could make you feel hurt and insecure, Cancer. They may not have been intentional, but even so, bear in mind that they're only words. They tell you far more about the one who said them than they do about you. Spend the evening with people who love and respect you. You mirror the best in them, and that's why they enjoy your company.",
      "matches": [
        1,
        7,
        10
      ],
      "ratings": [
        4,
        4,
        4,
        4
      ],
      "money": []
    },
    "tomorrow": {
      "text": "Jan 29, 2021 - Recent successes haven't made you feel you can rest on your laurels, Cancer. Rather, you're more likely to work harder. Today you might spend a lot of time considering different options for improving your socioeconomic status. Among them might be enterprises connected with the planet. Business and romantic partners could inspire you.",
      "matches": [
        2,
        8,
        11
      ],
      "ratings": [
        3,
        3,
        3,
        4
      ],
      "money": []
    },
    "week": {
      "text": "Jan 25, 2021 - Jan 31, 2021 - Forget social obligations this week, Cancer! As the sun in Aquarius squares Uranus in Taurus on Tuesday, you may not feel up to doing things that are ?expected? of you. Conserve your energy and do what makes you feel good.Your self-esteem gets a major boost when the full moon is in generous Leo on Thursday. The moon is in your sector of value, making self-care a must. If you?ve been investing in yourself lately, you?ll start to see it pay off.On Saturday, Mercury retrogrades in Aquarius (groan). This retrograde occurs in your sector of intimacy, creating some communication issues when talking about personal matters and taboos. This could lead to problems creating and maintaining bonds with others, being able to let go of the past, and stunting your attitude about growth. Don?t be afraid to let go and let grow. ",
      "love": "Jan 25, 2021 - Jan 31, 2021 - The eccentric sun-Uranus square early in the week can cause confusion in your love life. Just when you thought things were one way, they go in an entirely new direction. Get used to the up-and-down feeling, Cancer. It?s going to be here for a while.The moon is your ruler, so when it?s full in fire sign Leo in the middle of the week, it has a profound effect on you. This is your chance to get closure from a past love, especially one who ghosted you.There?s a sun-Jupiter conjunction about the same time that can shed some light on whether you have ?meant to be? vibes with someone you like. Pay close attention to their body language when you?re together.",
      "career": "Jan 25, 2021 - Jan 31, 2021 - Expect quiet days and an opportunity to finish outstanding projects now. Events could bring an unexpected flirtation. The energy is likely to bring a strong need to put the welfare of your family first. It's a powerful time to talk with people who have your best interests at heart. This could lead to a break with the way you've been doing things.",
      "wellness": "Jan 25, 2021 - Jan 31, 2021 - If sheer frustration is giving you headaches, calm your thinking and give your mind a rest. It's better not to keep pushing to achieve something that isn't going to work. In a few days you'll feel a lot less wired than you have been lately. It will be quite a relief.",
      "money": "Jan 25, 2021 - Jan 31, 2021 - With an emphasis on past lives, karma, and institutions, it's best to be patient. Your subconscious may receive signs from your spirit guides and guardian angels, and not all of them will make sense. The anti-establishment is encouraged, so don't be surprised if the same old, same old isn't doing it for you anymore. You have the power to communicate what you see for fun and profit.",
      "matches": [
        12,
        6,
        9
      ],
      "ratings": [
        2,
        4,
        3,
        2
      ]
    },
    "month": {
      "text": "January 2021 - As mighty Mars heats up your solar eleventh house of communities and long-term vision, Cancer, you are going to feel energized and quite excited. This lasts until the beginning of March. Not only will you now see that some of your hopes and dreams are within reach, but you?ll also see your social life erupt with excitement. Build your networks personally and professionally during this time. You will certainly hear from many acquaintances and likely be invited to plenty of events.Partnership will also be on your mind in January as the sun and new moon align on January 12. This opens a doorway for you to improve your significant relationships and make plans together. Some Cancers could feel the impetus to get engaged or even marry. Single Cancers can use this vibration to find people with long-term relationship potential. With Venus dancing through your sector of intimacy for the second half of the month, you?ll certainly be feeling the warmth.?Mark down the best dates for your zodiac sign with your Cancer Monthly Horoscope! ?However, make commitments or sign contracts soon because Mercury will be slowing down to turn backward on the thirtieth. With its impending retrograde in your intimacy sector, you will find that you?re reassessing where you stand in your unions and if you?re receiving everything you deserve.The month ends with a full moon in your solar second house of finances on January 28, which could trigger a raise, new job, or new client for those Cancers who are freelancers. Welcome in the abundance now.Standout days: 9, 23, 28Challenging days: 4, 13, 14",
      "matches": [
        12,
        6,
        9
      ],
      "ratings": [
        2,
        4,
        3,
        2
      ],
      "money": []
    },
    "year": {
      "text": "\nMake yourself a top priority this year.Your sign is linked with your roller coaster emotions, so it makes sense that your ruler is the emotional moon. Paying close attention to the moon's movements will help you understand your moodiness a little better this year, starting with a full moon\/lunar eclipse in your sign in the middle of January. You may feel lasting effects of this lunation as it is closely tied to family relationships, especially parent-child. Reunions and healing can take place now but be careful not to fall back into the same old unhealthy dynamics you've been trying to escape once the happiness subsides.✨Reveal what 2021 has in the stars for you with your Yearly Horoscope! ✨A new moon\/solar eclipse in your sign at the end of June coincides with the start of your birthday month, giving you a chance to reboot and begin again (especially in areas that concern your priorities and the people who have come and gone from your life in the past year). This is a chance to figure out what's been missing and what's okay to let go of. Anything that's outlived its use can be discarded now, Cancer. Let it go gently, but surelyThe sun in your sign at the end of June until end of July is the perfect time to practice self-care and to protect your loved ones. You know that taking care of yourself is closely linked to your ability to take care of others, so if you haven't been in a good position to do things for yourself, your familial bonds might be suffering as well. Take a spa day or weekend to recharge. Happy birthday caring, giving Cancer!\n",
      "matches": [],
      "ratings": [],
      "money": [],
      "love": [],
      "career": [],
      "wellness": []
    }
  },
  {
    "today": {
      "text": "Jan 28, 2021 - Today you might decide to sign up for an advanced course of some kind, Leo. This might include world religions or perhaps meditation. Stay out of bookstores, both physical and online. You might spend a fortune on books on your chosen subject. The effect of this is likely to be more profound than a simple accumulation of knowledge. Prepare to be transformed.",
      "matches": [
        3,
        9,
        12
      ],
      "ratings": [
        3,
        3,
        3,
        4
      ],
      "money": []
    },
    "yesterday": {
      "text": "Jan 27, 2021 - Attempts to attend a festival, party, or other group activity could be hampered by minor obstacles like traffic jams, forgetting things, and getting lost, Leo. This can be frustrating and irritating, but don't let it stop you. It's important to be out with your friends today. Fill up the car, get a good map, and make your way to the place by the side streets. Have some fun!",
      "matches": [
        1,
        7,
        10
      ],
      "ratings": [
        2,
        4,
        3,
        2
      ],
      "money": []
    },
    "tomorrow": {
      "text": "Jan 29, 2021 - This is likely a day when you want to reflect on your successes. As your professional success continues to skyrocket, your sense of self-confidence follows suit. So do your relationships with family, friends, children, and romantic partners. Your mind is especially sharp, Leo, and your personal innovations should continue to progress. Life is good and likely to stay that way for a while.",
      "matches": [
        3,
        9,
        12
      ],
      "ratings": [
        4,
        2,
        4,
        3
      ],
      "money": []
    },
    "week": {
      "text": "Jan 25, 2021 - Jan 31, 2021 - The week starts with some vulnerability as the sun in Aquarius squares Uranus in Taurus on Tuesday. If you're struggling, don't put on a brave face. That will only make it worse. Instead, put your pride aside and let people help you.Fortunately, you'll get the opportunity to strut your stuff when the full moon is in your sign on Thursday, giving you its manifesting energy. All the goals you've been working toward since August are finally coming to fruition. Take action and bask in the spotlight, Leo. It was made for you.However, the week ends on a sour note as Mercury retrogrades in Aquarius on Saturday. This retrograde occurs in your house of partnerships, making your relationships tense for the next couple of weeks. Petty squabbles and misunderstandings could damage your interactions if you aren't careful. Try not to let your competitive nature burn any important bridges. ",
      "love": "Jan 25, 2021 - Jan 31, 2021 - Are you ready for something completely different? The sun-Uranus square early in the week likes to mix things up and keep you on your toes. Be prepared for anything, Leo!A full moon in your fun-loving and passionate sign midweek provides energy that?s perfect for dating. If you?re limited in your activities, use your creativity to come up with something totally unique.A sun-Jupiter conjunction about the same time shines a light on your soul mate, so be sure to pay attention to signs from the universe. Wouldn?t it be funny if they?ve been right in front of you this whole time?!",
      "career": "Jan 25, 2021 - Jan 31, 2021 - This is a strong period for you. Conflict can help you identify what you really want. The energy may bring you to a crossroads in your thinking. This is a powerful time to make a decision about your future. Expect to have good times with co-workers. This is a positive time to plan travel or education in pursuit of a better job. The energy could bring a work-related flirtation to your attention.",
      "wellness": "Jan 25, 2021 - Jan 31, 2021 - Life may be disjointed, which could account for your feeling ill at ease. With a lot happening in your life, it's important that you not allow yourself to feel pressured. No matter what is happening on the outside, take the time to eat properly and be good to yourself. Experiment with what works best for your health, especially where your diet is concerned.",
      "money": "Jan 25, 2021 - Jan 31, 2021 - You have a great deal of change happening now in your house of other people's money, indicating fundraising and debt repayment. If you're starting a new business, it's time to approach investors and venture capitalists, Writing and editing the perfect business plan will help you make your case to everyone. You may find that the larger entities can offer you the best deal going forward.",
      "matches": [
        3,
        9,
        12
      ],
      "ratings": [
        3,
        3,
        3,
        4
      ]
    },
    "month": {
      "text": "January 2021 - Prepare for your professional life to shoot off like fireworks at the onset of January, Leo. Mighty Mars will be heating up your achievements and ambitions until the beginning of March. Not only will you see opportunities come your way, but you must use this firepower to charge toward your goals. You can make much progress during this window of time.The sun will also be heating up your solar sixth house of productivity early on and unite with the goddess of the night to create a new moon on January 12. A doorway to improve your employment will open in your life. Look for new job opportunities, clients, or projects at this time, or ask your boss if you can take on more. It will aid your rise. Because this same house rules your health, exercise, and routine, this would be an excellent moment to set new fitness goals, too.?Mark down the best dates for your zodiac sign with your Leo Monthly Horoscope! ?Another important theme this month centers on partnership as Mercury and Venus bring connection and pleasure for you in relationships. However, be sure to make plans and agreements as soon as you can because there is an impending Mercury retrograde that begins on the thirtieth.To end a busy month, a full moon in your zodiac sign arrives on January 28 and allows you to take center stage. The world?s eyes will turn to you at this time. A highly important personal goal will likely culminate. Reach toward it, for it may now be yours.Standout days: 11, 14, 20Challenging days: 17, 23, 26",
      "matches": [
        3,
        9,
        12
      ],
      "ratings": [
        3,
        3,
        3,
        4
      ],
      "money": []
    },
    "year": {
      "text": "\nBe the best Lion you can be in 2020!You love basking in attention so it's only fitting that your ruler is the ego-boosting sun. When 2020 begins the sun is in earthy, responsible Capricorn, so you'll find yourself doing things for the sense of accomplish more than the glory. That all changes by the end of July, however, when the sun moves into your flashy sign and welcomes in your birthday month. Happy birthday expressive, creative Leo! Your mood is outgoing and playful, and you crave strong reactions to your antics. For the next four weeks you're the life of the party, and you add the color and drama that's been missing from your loved ones' lives.✨Reveal what 2021 has in the stars for you with your Yearly Horoscope! ✨The emotional moon is the yin to the sun's egotistical yang, so the new Cancer moon\/solar eclipse at the end of June is also enlightening for you, Leo. This highly reflective time brings some uncomfortable emotional topics to the surface that you won't be able to hide from, and it might feel as though you aren't yourself. Your personality can't ever truly be blocked, as the sun is now by the moon, but it can be subdued. Take a clue from this relatively somber time and make room for new emotional beginnings.Wounded Chiron is also traveling in driven Aries (who rules the first house of self and is a fellow fire sign) this year - which can throw you full on into \"who am I?\" mode. An identity crisis is one of your worst nightmares and can put a lot of stress on your ego. Luckily you get a break from this angsty energy between the beginning of July and middle of December, when this troubling pair goes retrograde and gives you some room to remember who you truly are.\n",
      "matches": [],
      "ratings": [],
      "money": [],
      "love": [],
      "career": [],
      "wellness": []
    }
  },
  {
    "today": {
      "text": "Jan 28, 2021 - A group of friends may invite you to attend a festival or workshop involving the creative arts or metaphysical studies, or perhaps both, Virgo. You might resist at first, but once you get there you will find the subject and instructor captivating. Afterward, you won't want to talk about it. You will be too preoccupied with your thoughts. Write them down. You will want to remember them later.",
      "matches": [
        4,
        10,
        1
      ],
      "ratings": [
        4,
        2,
        4,
        3
      ],
      "money": []
    },
    "yesterday": {
      "text": "Jan 27, 2021 - Some friends may put you in front of a lot of people, Virgo, perhaps to make an impromptu speech or lead a discussion. Generally, you don't mind this, but today you're in a quiet mood and would rather stay on the sidelines. You could grit your teeth and do what they ask. But don't be afraid to tell your friends how you feel. They don't really want to make you uncomfortable.",
      "matches": [
        4,
        10,
        1
      ],
      "ratings": [
        3,
        3,
        3,
        4
      ],
      "money": []
    },
    "tomorrow": {
      "text": "Jan 29, 2021 - Surprising developments in your life might bring a lot of visitors and much happiness to your home. You could host a party or other sort of gathering. This is likely to keep you very busy throughout the day, Virgo, but you will have fun all the same. Don't let shop talk interfere with times like this. This is the time to relax and enjoy your good fortune. Use it to your advantage.",
      "matches": [
        3,
        9,
        12
      ],
      "ratings": [
        4,
        3,
        4,
        3
      ],
      "money": []
    },
    "week": {
      "text": "Jan 25, 2021 - Jan 31, 2021 - As the helper of the zodiac, you're always willing to go the extra mile for others. However, when the sun in Aquarius squares Uranus in Taurus on Tuesday, use that helpful nature to take care of yourself. What can you do to make your life easier?Hidden talents could come to the fore when the full moon is in Leo on Thursday. The moon is in your sector of privacy, revealing things from your inner depths, including things you weren't aware of before now.Then it's the dreaded retrograde of Mercury on Saturday. Mercury's retrograde affects you more than others because it's your ruling planet, so expect to feel a little more anxious than normal. Mercury reverses in Aquarius and your sector of routine, so you might see some delays in your work and productivity as your schedule gets messed up. Don't forget to save all your work! ",
      "love": "Jan 25, 2021 - Jan 31, 2021 - There's a frantic kind of energy coming off the sun-Uranus square in Aquarius early in the week that makes you a little nervous. If you're just getting to know someone new, try to be yourself instead of who you think they want you to be.An intensely romantic Venus-Pluto conjunction in the middle of the week strengthens the bond between you and someone you really like, perhaps a platonic friend. Are you willing to risk what you have to take things to the next level? Have an honest discussion about the potential consequences.A sun-Jupiter conjunction about the same time prompts you to think about destiny and its role in your love life. Do you believe in soul mates? If you do, you might have already encountered yours.",
      "career": "Jan 25, 2021 - Jan 31, 2021 - This can be a challenging but productive time. Do the best you can without expecting personal recognition. Flashier or more domineering types are likely to take up most of the oxygen in the room. You'll be happiest working alone or in a management position. Other people's failings or weaknesses can be frustrating. The energy is lucky for job hunting. Do what you can to honor the contributions of others.",
      "wellness": "Jan 25, 2021 - Jan 31, 2021 - Too much thinking is wreaking havoc on your health. This translates into tension that gives rise to muscle aches. Keep your head clear of too many troublesome thoughts, especially if you have a tendency to worry unnecessarily. A massage, hot bath, or relaxing aromatherapy session would work wonders. You might want to try meditation, too. It will help your blood pressure.",
      "money": "Jan 25, 2021 - Jan 31, 2021 - You have energy directed toward groups, politics, and self-employment. You have all the friends and contacts you need to begin a new venture, whether product, service, or project at your current job. You will also meet new people who can help you get where you want to be financially. At the same time, you're augmenting and transforming your union with other people. You have all the tools you need to get ahead.",
      "matches": [
        4,
        10,
        1
      ],
      "ratings": [
        4,
        2,
        4,
        3
      ]
    },
    "month": {
      "text": "January 2021 - Life will be very busy for you in 2021, Virgo, so get ready! Mighty Mars moves into your solar ninth house of expansion this month and stays until March. This means that many Virgos will be especially focused on academic, media, publishing, or international matters. Legal issues can also appear during this time.However, a lovely cosmic blessing this month will be the sparkle radiating from your solar fifth house of fertility and romance. The sun will be heating this arena up like a furnace! A new moon in this zone materializes on January 12 and opens a doorway for you to find love if you?re single or improve your rapport with your partner if you?re already committed. Some Virgos may have luck in conceiving if you?re trying. And if you harbor creative talents, new inspiration is certain to cross your path at this time.?Mark down the best dates for your zodiac sign with your Virgo Monthly Horoscope! ?However, despite the exciting new possibilities, you will begin to notice a slower pace approaching as early as mid-January because your ruler Mercury will be turning retrograde on the thirtieth. You are especially affected any time this occurs, and you could feel as though your mind is in a fog. Projects hit snags and you may feel the world grind to a halt. This period will especially affect your work projects, so realize that you might need to make some adjustments down the line in February.The month ends with a full moon in your solar twelfth house of rest and healing on January 28, further causing you to pull back, wait, and reflect. Focus on lying low at this time to see what the universe brings your way.Standout days: 4, 8, 14Challenging days: 9, 23, 26",
      "matches": [
        4,
        10,
        1
      ],
      "ratings": [
        4,
        2,
        4,
        3
      ],
      "money": []
    },
    "year": {
      "text": "\nTake care of your mind and body this year!Your ruler, Mercury, is one of the fastest moving planets, so your mind is naturally quick and alert. This year Mercury begins in practical, kindred earth sign Capricorn and quickly forms a conjunction with mind-expanding Jupiter, setting an optimistic tone for the year. Feeling broad-minded and sociable is a great way to start 2020.✨Reveal what 2021 has in the stars for you with your Yearly Horoscope! ✨There are also the usual three infamous Mercury retrograde periods to watch out for, this year between February 16 and March 9, June 18 and July 12, and October 13 and November 3. Since Mercury is your ruler, you probably know by now that this bad-mouthed transit will do its best to bring things to a standstill but don't worry - your positive actions can be very effective. This year's Mercury retrogrades all visit emotional water signs, so intuition often trumps logic when avoiding obstacles and dealing with dilemmasThe sun shines in your order-loving sign from the end of August until the end of September, so happy birthday practical, hardworking Virgo! The final days of summer are the perfect time to clear out the excess and get more organized. Friends and family might ask for your assistance getting themselves in order as well, as your reputation for being meticulous spreads. This is also a time to take care of health issues, so schedule your yearly doctors' visits and follow up on any tests or lab work you have done.\n",
      "matches": [],
      "ratings": [],
      "money": [],
      "love": [],
      "career": [],
      "wellness": []
    }
  },
  {
    "today": {
      "text": "Jan 28, 2021 - If you've considered a career in healing, psychic, or spiritual studies or the creative arts, Libra, today the opportunity to make that dream a reality could come your way. A close friend could open the door for you. Your own psychic and artistic abilities should be operating at a very high level, so don't be intimidated. You're good at what you do and are likely to remain so.",
      "matches": [
        4,
        10,
        1
      ],
      "ratings": [
        4,
        3,
        4,
        3
      ],
      "money": []
    },
    "yesterday": {
      "text": "Jan 27, 2021 - Someone who's a little belligerent and abrasive could interrupt the flow of ideas at a class or workshop dedicated to spiritual and metaphysical concepts and values. This won't sit well with you, Libra, but you aren't the type to be confrontational. Don't worry. Let the person have his or her say, then let everyone else debate. Enjoy yourself and learn from all the ideas.",
      "matches": [
        5,
        11,
        2
      ],
      "ratings": [
        4,
        2,
        4,
        3
      ],
      "money": []
    },
    "tomorrow": {
      "text": "Jan 29, 2021 - Some wonderful new developments could take place in your community, Libra. You might meet some new people who move in nearby. New businesses could also arrive and give a whole new look to the area. You could spend a lot of time visiting others to learn about what's happening. You might also consider fixing up your home, as recent success has made that possible. You will be busy all day.",
      "matches": [
        4,
        9,
        1
      ],
      "ratings": [
        3,
        3,
        4,
        4
      ],
      "money": []
    },
    "week": {
      "text": "Jan 25, 2021 - Jan 31, 2021 - This week could be a little overwhelming, Libra. Your desire for pleasure and fear of taboo could lead to an emotional conflict as the sun in Aquarius squares Uranus in Taurus on Tuesday. It?s okay to take a walk on the wild side of life, but don?t lose your head.Get active when the full moon is in Leo and your sector of friendship on Thursday. This is an excellent opportunity to spend time with friends and reconnect. If you?ve been dreaming of something, that dream could become reality.Mercury goes into retrograde in Aquarius on Saturday, messing up both your weekend and the next few weeks. Mercury reverses in your pleasure sector, creating issues in how you express yourself creatively and how you experience pleasure. This is a good time to change your video-streaming password, and don?t send any compromising photos. ",
      "love": "Jan 25, 2021 - Jan 31, 2021 - A sun-Uranus square in the first part of the week sets a rather discouraging tone. Do you feel like you can't truly be yourself around someone you like? Then they're probably not the one for you, Libra.A midweek Leo full moon puts you in a more playful mood and reminds you that dating and romance are supposed to be fun. Rejection can be quite painful now, but not if you don't dwell on it. You're amazing and anyone who doesn't see that needs to have their eyes checked!A more positive sun-Jupiter conjunction about the same time gives you reason to be optimistic about love. Even if things aren't perfect, they're getting better and better each day.",
      "career": "Jan 25, 2021 - Jan 31, 2021 - This is a lucky time for you. Expect to enjoy pleasant and fortunate contacts with co-workers and customers. Do what you can to finish assignments. You can be feeling lazy or restless now. It's lucky for work-related travel. The energy is positive for staff parties and recognizing supporters. Be patient with irritable or demanding superiors. Tension caused by differing points of view can ultimately be helpful.",
      "wellness": "Jan 25, 2021 - Jan 31, 2021 - Life looks a lot easier now, so you'll be able to unwind no matter what stress you've been under. Let go of tension by exercising. Release any lingering resistance to feeling your best. Doing this will increase your energy level dramatically. If you're feeling restless, alleviate this with massage and herbal baths.",
      "money": "Jan 25, 2021 - Jan 31, 2021 - You face a time of extreme growth in your career sector this week. You have renewed hope that you're going in the right direction, and faith in your own skills and natural abilities. You know what you want to do, and you've learned to do it well. Appropriate pay will be forthcoming. Your work is transforming for the better.",
      "matches": [
        4,
        10,
        1
      ],
      "ratings": [
        4,
        3,
        4,
        3
      ]
    },
    "month": {
      "text": "January 2021 - Relationships and intimacy have been major focuses for you for the last six months, and you're going to be feeling the urge to merge even more from now until March as Mars powers up your solar eighth house. You will be hungry to pull your special person closer than ever. This may manifest in yet another way, such as you being eager to tie up debts or push toward getting a loan, credit card, venture capital, or settlement.However, be sure to use the earlier weeks of the month to sign contracts or apply for loans because our cosmic messenger Mercury turns backward on January 30. After that, February will be riddled with delays and frustration in all communications and legal matters.✨Mark down the best dates for your zodiac sign with your Libra Monthly Horoscope! ✨Romance will be significant this month and in the year to come because of so much focus on your solar fifth house of passion. Your ruler Venus enters here on the eighth to bring extra special attention to matters of the heart. Embrace this now or in the month ahead.Another important focus for you in January is home and family, with the sun and the goddess of the night uniting to create a new moon on January 12. This luminary could help you find the perfect living space, move, or attend to an important family situation. No matter what, you can find more stability if you try.The last thing to note this month is the full moon that draws attention to your solar eleventh house of community on the twenty-eighth. You may attend a lovely event at this time or feel the need to expand your network. Fun and excitement are sure to follow.Standout days: 9, 11, 28Challenging days: 4, 20, 26",
      "matches": [
        4,
        10,
        1
      ],
      "ratings": [
        4,
        3,
        4,
        3
      ],
      "money": []
    },
    "year": {
      "text": "\nYour sense of fairness drives you to success.Your lovely home planet, Venus, begins the year in airy Aquarius but quickly moves into sensitive, compassionate Pisces in the middle of January. This comfortable pairing creates a romantic, dreamy flow of love that will help you be more understanding, forgiving and affectionate. Venus travels through your sign starting at the end of October, putting close relationships in the spotlight. Don't let your willingness to negotiate with people lead to crippling indecisiveness.✨Reveal what 2021 has in the stars for you with your Yearly Horoscope! ✨The one retrograde cycle your power planet experiences this year is from mid-May until the end of June while in brainy Gemini, causing you to think deeply about incongruities in your life. This transit encourages you to explore dualities in your life and work out love\/hate relationships so you can find the balance and peace that you value so highlyThe sun highlights your sign for a month starting in late September, so happy birthday cooperative, diplomatic Libra! Your beauty (inside and out) is evident, and you're often looked up to as the standard by which other people want to live their lives. Decision-making can be a challenge now as you look for the ultimate fair solution, but sometimes there isn't one that will make everyone happy.\n",
      "matches": [],
      "ratings": [],
      "money": [],
      "love": [],
      "career": [],
      "wellness": []
    }
  },
  {
    "today": {
      "text": "Jan 28, 2021 - Romance could be on your mind today, Scorpio. This could be due to a recent wonderful encounter with a love partner. Since then, listening to romantic music may have enhanced your feelings. You will want to schedule another meeting, but you might hold back because you don't want to seem pushy. Go ahead and call your friend. You might be pleasantly surprised by the response.",
      "matches": [
        5,
        10,
        2
      ],
      "ratings": [
        3,
        3,
        4,
        4
      ],
      "money": []
    },
    "yesterday": {
      "text": "Jan 27, 2021 - An upset between you and a friend might cause you to wonder what you did wrong, Scorpio. Chances are you were just in the wrong place at the wrong time. Your friend may have money problems and be too embarrassed to talk about it. Wait a few days and call again to see how things are. Your friend will feel more like talking, and all should be OK between you.",
      "matches": [
        5,
        11,
        2
      ],
      "ratings": [
        4,
        3,
        4,
        3
      ],
      "money": []
    },
    "tomorrow": {
      "text": "Jan 29, 2021 - A high level of self-confidence and optimism should stay with you throughout the day, Scorpio. Your energy is good, as is your enthusiasm. The success and good fortune that have been coming your way are likely to stay with you. You may have just been blessed with more money and happiness. Of course, this feeling is also likely to attract more friends. Make the most of it!",
      "matches": [
        4,
        12,
        1
      ],
      "ratings": [
        3,
        4,
        2,
        4
      ],
      "money": []
    },
    "week": {
      "text": "Jan 25, 2021 - Jan 31, 2021 - Your solid foundation could face a few shake-ups this week when the sun in Aquarius squares Uranus in Taurus on Tuesday. You might feel the need to resist tradition and forge your own path. However, don?t neglect your established partnerships as you go your own way.You?ll get a boost in your reputation when the full moon is in Leo on Thursday. The moon is in your career sector, which could mean you receive recognition for your achievements. You?re famous for playing the long game, Scorpio, and you could finally see the fruits of your labors.However, domestic drama could put a damper on your weekend when Mercury retrogrades in Aquarius on Saturday. This retrograde occurs in your family sector and could create some serious communication issues at home. Whether you get into a heated discussion about politics or bicker about what streaming service to use, expect your home life to be a little tense.",
      "love": "Jan 25, 2021 - Jan 31, 2021 - As a fixed sign, you love routine, and the sun-Uranus square in Aquarius loves to upset the status quo. Interestingly, you're not upset, but it can be frustrating to lose control.A Leo full moon in the middle of the week injects some fun into your love life, and playing online games against each other is a great dating idea. However, try not to be a sore loser, Scorpio!Romantic Venus conjoins secretive Pluto, your co-ruler, around the same time, so you aren't above playing mind games now either. Passive-aggressiveness might feel good in the moment, but it isn't your most attractive quality.",
      "career": "Jan 25, 2021 - Jan 31, 2021 - There could be unexpected challenges now. Someone with a self-righteous attitude can make things difficult for you. The energy supports a review of financial and legal matters. Human-resource questions shouldn't be ignored. Try to respect everyone's need for recognition. You may have an opportunity to set a rumor to rest. Get as much done as possible now. This is a time to relax and enjoy yourself.",
      "wellness": "Jan 25, 2021 - Jan 31, 2021 - Start a practice like meditation, yoga, or tai chi. It will help your whole system settle into a more balanced state. This is important if you're dealing with more stress than usual. You may have no control over circumstances, which can be exhausting and draining. Take action. Sign up for some classes so you can feel renewed.",
      "money": "Jan 25, 2021 - Jan 31, 2021 - For you, this week is about securing your financial future. Luck and expansion affect romance, family, and fun. This is a great time to spend on activities that benefit everyone, from an educational trip to a purchase for the home. And learning and teaching are encouraged, so you will all take away an important life lesson.",
      "matches": [
        5,
        10,
        2
      ],
      "ratings": [
        3,
        3,
        4,
        4
      ]
    },
    "month": {
      "text": "January 2021 - Partnership will be extremely important to you in January and February as mighty Mars dances across the sky from you, Scorpio. The universe is telling you that you must find the right partners at this time. Teamwork and collaboration are favored above all. Scorpios in committed unions will now feel the urge to make long-term plans with their significant other. Single Scorpios will feel an intrinsic urge to date and unite with people at this time, so be sure to look now.This month?s new moon takes place on January 12, encouraging you to focus on important messages close to your heart, and it may see you begin a writing, speaking, or advertising initiative.?Mark down the best dates for your zodiac sign with your Scorpio Monthly Horoscope! ?However, be sure to sign contracts earlier in the month because Mercury goes retrograde on the thirtieth. Whenever this occurs, you are not encouraged to launch new projects or negotiations because they will likely fail later on.Your mind will also have a great deal of focus on your home and family now and in the year to come because of so much planetary activity in your solar fourth house. Many Scorpios will relocate or see their family shift and expand this year, so now might be a good moment to consider your opportunities.To end a unique month is a full moon in your solar tenth house of achievement on January 28. This luminary will shed light on your ambitions and put your name in the stars! A promotion, new job, or opportunity for success and fame could suddenly appear around this time. Focus on hustling because it will pay off.Standout days: 13, 28, 30Challenging days: 12, 17, 23",
      "matches": [
        5,
        10,
        2
      ],
      "ratings": [
        3,
        3,
        4,
        4
      ],
      "money": []
    },
    "year": {
      "text": "\nNothing shakes your confidence this year!You've got that infamous Scorpio swagger already, but you'll really be feeling yourself when your power planet, Mars, spends time in your sign at the very beginning of the year. A couple days later Mars moves on to adventurous, knowledge-seeking Sagittarius, but for those first two days you're untouchable! Mars in Aries, the other sign it rules, packs another great punch when they team up at the end of June, but it could also cause you to be impatient and self-centered, which aren't two inherent Scorpio qualities✨Reveal what 2021 has in the stars for you with your Yearly Horoscope! ✨Your other co-ruler, contemplative Pluto, spends the year in driven Capricorn, so it will be even more important for you to get what you want. You might go to great lengths to reinvent yourself, but you aren't doing it for anyone else. This is your year to do you, Scorpio.The sun spends time in your confident sign at the end of October until late November, highlighting all your best qualities. Happy birthday intense, determined Scorpio! Your desires come to the surface, and you crave closer, more intimate relationships. You might be even more secretive now than usual, but you expect full disclosure from everyone else. You also ooze a magnetism that's hard for others to ignore, but you're very picky about who you let join your inner circle.\n",
      "matches": [],
      "ratings": [],
      "money": [],
      "love": [],
      "career": [],
      "wellness": []
    }
  },
  {
    "today": {
      "text": "Jan 28, 2021 - A very beautiful, romantic dream could inspire exalted artistic activities today, Sagittarius. You might want to paint, draw, write, compose music, sew, or cook up a new recipe. Whatever you do, you won't do it simply for your own amusement. You will want to show your work to others and seek their opinions and approval. Your business acumen could be as active as your artistic side.",
      "matches": [
        5,
        1,
        2
      ],
      "ratings": [
        3,
        4,
        2,
        4
      ],
      "money": []
    },
    "yesterday": {
      "text": "Jan 27, 2021 - Too many outside responsibilities at once could have you at odds with a current love partner, Sagittarius. Your beloved may seem to be demanding a choice between your job and the relationship. Don't read things into the situation that aren't there, and don't be too proud to talk about it. Pride really can come before a fall. Explain the circumstances in detail and all should be well.",
      "matches": [
        6,
        11,
        3
      ],
      "ratings": [
        3,
        3,
        4,
        4
      ],
      "money": []
    },
    "tomorrow": {
      "text": "Jan 29, 2021 - Happiness is the mood of the day, Sagittarius, as you enjoy the fruits of all your hard work over the past few years. You're able to pursue a few things that you've never been able to before. You're likely surrounded by old and new friends, and romance is blossoming. You probably also look especially attractive now. If all this sounds too good to be true, wake up! It's happening!",
      "matches": [
        7,
        1,
        4
      ],
      "ratings": [
        4,
        2,
        4,
        4
      ],
      "money": []
    },
    "week": {
      "text": "Jan 25, 2021 - Jan 31, 2021 - Communication is very important this week, Sagittarius. If you're struggling with an issue, speak up when the sun in Aquarius squares Uranus in Taurus on Tuesday. If something isn't working, try thinking about a new way to do it. It might be frustrating to try to convince others to see things your way, but it will be worth it.Adventure awaits you when the full moon is in Leo and your sector of philosophy on Thursday. This is a good time to expand your ideas and beliefs through travel or education. Seek out new experiences!Finally, Mercury goes retrograde in Aquarius and your sector of communication on Saturday, giving you a double whammy of communication issues. For the next couple of weeks it will be very important to watch what you say and how you say it. If you don't have anything nice to say, zip it! ",
      "love": "Jan 25, 2021 - Jan 31, 2021 - It will be hard to ignore the offbeat energy coming from the sun-Uranus square in quirky Aquarius early in the week, so you should try to find a way for it to work to your advantage. If you usually go left, try going right.There?s a passionate full moon in fellow fire sign Leo in the middle of the week, so you?ll want all eyes on you. There?s also more drama around your love life now than usual, which is something you?ll just have to ignore if you want to have a good time.A sun-Jupiter conjunction in freedom-loving Aquarius about the same time reminds you that you?re perfectly happy being single. You love to flirt and have a good time, but at the end of the day you?re okay going home alone. ",
      "career": "Jan 25, 2021 - Jan 31, 2021 - This is a very expansive time for you. It's possible to mix optimistic expectations with practical results. This is a strong period that supports activity, achievement, and a sense that you're at last on track. The energy is a powerful for any new start, including a job interview. Be open to accepting travel and educational opportunities from unexpected sources. Teamwork will bring the most satisfying results.",
      "wellness": "Jan 25, 2021 - Jan 31, 2021 - Put any difficulties from recent weeks behind you and enjoy the scents and sounds around you. You may have to deal with a few challenges, so be nice to yourself. Take the chance to relax in a bath filled with delightful aromas whenever possible. Get out in the fresh air, and visit one of the beautiful natural spots near you.",
      "money": "Jan 25, 2021 - Jan 31, 2021 - Things from the past may get dredged up again - both literally and figuratively - so they can be released, thrown out, fixed up, or changed. Though this may not be pleasant in the short term, it's necessary and even positive. Although every part of your life is changing, it's lucky, too. It affects your house of other people's money, so you may receive all you need and more.",
      "matches": [
        5,
        1,
        2
      ],
      "ratings": [
        3,
        4,
        2,
        4
      ]
    },
    "month": {
      "text": "January 2021 - Get ready for your productivity to launch into hyperdrive at the onset of January, Sagittarius. This firepower will be triggered by mighty Mars blazing a trail through your solar sixth house of employment and fitness until the beginning of March. You are set to be quite busy with work projects or clients. Hustle hard because this will impress higher-ups who are paying attention to your progress!Money will also be on your mind at this time with the sun igniting this area of your life. A new moon dawns here on January 12 and opens a doorway for you to get a new job, add more income to your freelance routine, or even possibly get a raise. Rake in the abundance and work for more because you will be supremely blessed.?Mark down the best dates for your zodiac sign with your Sagittarius Monthly Horoscope! ?Next to note this month is a great deal of focus on your mind and communication, with so much planetary activity here now and for the year ahead. Yet be aware that a Mercury retrograde will begin to creep in as early as midmonth, even though it officially starts on the thirtieth. Do your best to be patient because some revisions and reviews are likely to be asked of you.Finally, to end the month, a powerful full moon in your solar ninth house on January 28 encourages you to heed the urge to charge in new directions. While this may allow some Sagittarians to jet off to exotic destinations, others could be focused on legal, academic, media, or international business projects. A great culmination is likely to take place.Standout days: 4, 12, 28Challenging days: 13, 17, 26",
      "matches": [
        5,
        1,
        2
      ],
      "ratings": [
        3,
        4,
        2,
        4
      ],
      "money": []
    },
    "year": {
      "text": "\nIf you can envision it, you can make it a reality.As the fiery Archer, your outgoing, adventurous nature is backed by your power planet, optimistic Jupiter. This year, Jupiter is paired up with serious Capricorn again, so the mood still isn't that light. Your good luck is directly tied to your actions this year, essentially ensuring that you make your own luck by working hard and actively shaping your own future. A retrograde period from the middle of May to mid-September gives you a chance to review your goals, and reconsider some of your opinions\/ideals. If you're on the right track, forge ahead. But if you've been wrong, admit it and change direction.✨Reveal what 2021 has in the stars for you with your Yearly Horoscope! ✨You love to talk to people and expand your universe through world travel, which can all come to a standstill during this year's three Mercury retrograde periods. Be aware of the six-week cycles in mid-February, the middle of June and the middle of October where communication might be spotty and glitches in electronic devices can make your life difficult. Flight delays, mysteriously cancelled hotel reservations and GPS malfunctions make traveling nightmarish during this time, but because of Cancer's watery influence on these retrogrades (Cancer only influences Mercury in the summer), relying on your instincts to get you through can be a lifesaverThe sun stops by your house between the end of November to end of December, when your focus will be to make intimate connections to something larger than yourself. Happy birthday philosophical, searching Sagittarius! You have the best time expanding your horizons and visiting new places\/meeting new people now, especially if they can teach you something about the world and\/or yourself. Some people can't wait to reach the destination, but for you it's all about the journey.\n",
      "matches": [],
      "ratings": [],
      "money": [],
      "love": [],
      "career": [],
      "wellness": []
    }
  },
  {
    "today": {
      "text": "Jan 28, 2021 - A rush of intense love and romantic passion for a special someone might turn your mind toward marriage, Capricorn. The wedding of a friend may contribute to these thoughts. Your partner may still have doubts about moving to the next level of commitment, even though there's no question that he or she truly loves you. Be patient and hold your tongue. You will know when the time is right.",
      "matches": [
        8,
        2,
        5
      ],
      "ratings": [
        4,
        2,
        4,
        4
      ],
      "money": []
    },
    "yesterday": {
      "text": "Jan 27, 2021 - An unexpected problem with a task you're trying to finish could cause a temporary upset between you and those closest to you, Capricorn. This might have your family stomping out of the house in anger. Remember that everybody has their own concerns, and probably wouldn't have reacted this way otherwise. Finish what you have to do and patch things up later. All should be well.",
      "matches": [
        6,
        2,
        3
      ],
      "ratings": [
        3,
        4,
        2,
        4
      ],
      "money": []
    },
    "tomorrow": {
      "text": "Jan 29, 2021 - All the success and good fortune you've enjoyed over the past several months may have freed you from the grind enough to concentrate on spiritual or artistic interests. There may be a few surprises in store for you, Capricorn. You may meet some new people who share your interests. What you learn from them could improve your progress. You might embark on a new course of study.",
      "matches": [
        7,
        2,
        4
      ],
      "ratings": [
        3,
        3,
        3,
        3
      ],
      "money": []
    },
    "week": {
      "text": "Jan 25, 2021 - Jan 31, 2021 - You start the week with the sun in Aquarius squaring Uranus in Taurus on Tuesday, creating some creative blockage. Just because you're not making money off your pet passion, it doesn't mean it has no value. If you enjoy it, Capricorn, it's valuable.On Thursday, the full moon is in Leo and your intimacy sector, making it a great day for personal transformation. If you've been working on your personal growth, you could finally see it pay off in your intimate relationship. However, don't fall back into old grudges. Be like Elsa and let it go.Change your passwords when Mercury goes into retrograde in Aquarius on Saturday. This retrograde occurs in your sector of value, which could manifest itself as problems with electronics. It could also lead to some self-worth issues. Speak to yourself with kindness for the next couple of weeks. ",
      "love": "Jan 25, 2021 - Jan 31, 2021 - There's a quirky sun-Uranus square in the first part of the week that will inevitably throw you off your game. Embarrassing yourself is something you dread, but acting like it never happened probably won't be an option. Keep your composure if at all possible.The full moon is in Leo midweek, bringing out your hidden talents and creativity. If you aren't comfortable being on stage, give someone a private show.There's an intense Venus-Pluto conjunction around the same time that can bring you closer to someone you really care about. Is this love? You might be falling, Capricorn.",
      "career": "Jan 25, 2021 - Jan 31, 2021 - You can find wonderful opportunities now if you're open to the energy that encourages expansion, travel, and training. These are good days for research, planning purchases, and paying bills. The energy is the luckiest now for a job interview or requesting an upgrade to your current situation. The energy supports positive contacts with customers and co-workers. Casual conversations will help sharpen good ideas and can lead some to better career opportunities.",
      "wellness": "Jan 25, 2021 - Jan 31, 2021 - Continue to take responsibility for your health. You'll make fabulous progress if you develop an exercise routine that you enjoy. If you make this a regular discipline, you'll feel better in all ways. Most of all, take baby steps toward achieving a state of total health. The more you feel that inner balance, the brighter you'll shine.",
      "money": "Jan 25, 2021 - Jan 31, 2021 - You have all kinds of happy energy coming to your relationships now. If you're attached, you will enjoy renewed feelings for one another. If you aren't, you may find a larger pool of potential mates. The same is true for business concerns, as you can meet mentors, partners, and even investors under this cosmic climate. You may earn more by speaking your mind.",
      "matches": [
        8,
        2,
        5
      ],
      "ratings": [
        4,
        2,
        4,
        4
      ]
    },
    "month": {
      "text": "January 2021 - With the mighty sun igniting your zodiac sign at this time, it is your birthday season! You have or will soon go through your solar return, when you can make important plans for the year ahead. Consider how you?d like to build your life, and take action to manifest your goals in the days that follow the new moon that takes place on January 12 in your zodiac sign. This provides a doorway for you to pursue some of your most heartfelt plans and desires. This luminary provides the boost you need to aim high and to soar.It is also clear that passion and love will be important to you right now as Mars heats up your solar fifth house until March. Single Capricorns will have a tremendous opportunity to find a soul-mate connection, whereas committed ones may feel the spice reignite within their relationship. Those Capricorns pursuing conception and pregnancy also have Mars on their side.?Mark down the best dates for your zodiac sign with your Capricorn Monthly Horoscope! ?Another major focus this month is money, and the universe is especially focused on bringing you more. You have the Midas touch now and for the year ahead, so hustle and watch it come to you like a magnet.However, if you need to sign new contracts, be aware that Mercury rules communication and is approaching another retrograde, which begins on the thirtieth. Try to tie up any legal issues before that.Last to note is that you will experience a full moon in your solar eighth house on January 28, which could spotlight a debt, loan, scholarship, or investment matter. Be aware, though, that with the approaching retrograde, you need to read the fine print before you lock yourself into something long term.Standout days: 1, 9, 13Challenging days: 12, 23, 26",
      "matches": [
        8,
        2,
        5
      ],
      "ratings": [
        4,
        2,
        4,
        4
      ],
      "money": []
    },
    "year": {
      "text": "\nCombine the old with the new to be more successful this year.Your home planet Saturn arrived in your practical sign back in December of 2017 and continues that trip for part of this year as well. You should be especially focused on your goals now and may be particularly in tune with your ultimate purpose in life. You must be willing to make changes to meet your full potential, but a hardworking Goat is never afraid to do whatever it takes to climb to the top. Development and progress in all areas of life are possible this year if you focus on yourself and what's most important.A Saturn retrograde period begins in mid-May, after Saturn has moved into free-thinking Aquarius (back toward the end of March). This retrograde cycle gives you some breathing room and encourages you to look back on the past several months for areas in your life that could use a do-over.✨Reveal what 2021 has in the stars for you with your Yearly Horoscope! ✨The sun visits your disciplined sign at the end of December, so happy birthday ambitious, goal-oriented Capricorn! You're an understated sign who prefers to keep your head down and work toward your goals for the most part, but during your birthday month you might come alive in unexpected ways. Most people might not know you have a wicked sense of humor that you express in a sarcastic tone, or that Christmas is your favorite holiday! Sharing more of yourself with others will broaden your social circle.\n",
      "matches": [],
      "ratings": [],
      "money": [],
      "love": [],
      "career": [],
      "wellness": []
    }
  },
  {
    "today": {
      "text": "Jan 28, 2021 - Today you could experience a strong desire to clear your psyche of past traumas that limit you, Aquarius. You may decide to register for a seminar or workshop of some kind. If you sign up today, all signs are that you will not only attain the results you want but you will also meet some interesting new people. Among them could be a potential love partner. Go for it, and have fun.",
      "matches": [
        8,
        3,
        5
      ],
      "ratings": [
        3,
        3,
        3,
        3
      ],
      "money": []
    },
    "yesterday": {
      "text": "Jan 27, 2021 - An upsetting dream about someone you love deeply could cause you to awaken suddenly in the night, Aquarius. You might have to ground yourself a little in reality before trying to go back to sleep. Stay calm. The dream isn't prophetic. It probably relates to your own fears about this person, or maybe even about yourself. Wait until morning and write down the dream. The meaning should clarify by then.",
      "matches": [
        9,
        3,
        6
      ],
      "ratings": [
        4,
        2,
        4,
        4
      ],
      "money": []
    },
    "tomorrow": {
      "text": "Jan 29, 2021 - The company of good friends, perhaps at a group activity or festival of some kind, contributes to a powerful feeling of good health, good fortune, and happiness, Aquarius. You will probably want to spend a lot of time outdoors today. Sports might appeal to you. There will be a few minor accidents - dropping things, spilling drinks - but in all, this should be a satisfying day.",
      "matches": [
        8,
        3,
        4
      ],
      "ratings": [
        4,
        4,
        4,
        3
      ],
      "money": []
    },
    "week": {
      "text": "Jan 25, 2021 - Jan 31, 2021 - Emotions could run high when the sun in your sign squares Mars and Taurus on Tuesday and creates tension at home. While it might be tempting to block out different emotions and go into robot mode, it wouldn?t be helpful. Instead, use your brilliant mind to come up with a unique approach to make everyone happy.Love comes into full bloom when the full moon is in vibrant Leo on Thursday. The moon is in your partnership zone, meaning any relationships and attractions you?ve been working toward can finally manifest. Enjoy!However, Mercury goes into retrograde on Saturday. Mercury is reversing in your sign, making the next few weeks extra tricky because you could have difficulty starting new projects and lack self-awareness. The best way to handle this is to stay off social media and keep a low profile as you try to make the best of things. ",
      "love": "Jan 25, 2021 - Jan 31, 2021 - The sun and your ruler Uranus square off early in the week, giving you a lot of different and unusual options. Luckily, you aren't very worried about what other people will think when your odd little romantic idiosyncrasies are brought to light.A Leo full moon in the middle of the week encourages you to stay in the spotlight and show your true talents. It's likely you'll meet someone now who is attracted to your unique sense of style.The sun-Jupiter conjunction about the same time makes you feel like anything is possible, and perhaps it is. If you're ready to try again, this is the perfect time to get back into the dating world.",
      "career": "Jan 25, 2021 - Jan 31, 2021 - This is a lucky time for you. The energy supports a careful look at your cash flow. Finish as much as possible so you can clear your schedule. The aspects now are the most positive for a job interview or any sort of improvement in your career prospects. The energy will allow you to combine practical management with a big-picture view of your situation.",
      "wellness": "Jan 25, 2021 - Jan 31, 2021 - You don't seem to have any real health problems, but you could be taking on too much. The cosmos indicates that you may have a tendency to overextend yourself and think that you can do more than you're physically capable of. There's also a degree of tension around, and this, too, may mean that you aren't feeling as together as usual. Be good to yourself!",
      "money": "Jan 25, 2021 - Jan 31, 2021 - This week you have a focus on your job. Ask yourself if you're happy doing what you're doing for a living or if you should make some changes. If it's the latter, some thought and applied action can yield wonderful results. A supportive aspect indicates a time of renewed interest in your money life, investments, and security. You're on the right track.",
      "matches": [
        8,
        3,
        5
      ],
      "ratings": [
        3,
        3,
        3,
        3
      ]
    },
    "month": {
      "text": "January 2021 - Mighty Mars heats up your solar fourth house at the onset of January, so you are especially focused on home and family matters. You could become highly energized regarding a move or renovation or be dealing with an important situation surrounding a family member. This will likely keep you busy until March.Another area of focus is about taking time to pull back and rest. The sun and new moon meet on January 12, telling you to recharge your batteries.?Mark down the best dates for your zodiac sign with your Aquarius Monthly Horoscope! ?Life becomes brighter when the sun joins your zodiac sign for the month ahead, starting on the nineteenth, bringing even more power to you, along with Mercury, Venus, Jupiter, and Saturn! With so many planets in your zodiac sign, it is clear that you have a tremendous amount of dominance now and the ability to shift matters in your favor. Use this time to make plans for what you?d like to launch in the year ahead, and get ready to move the pieces strategically forward.With Venus in your zodiac sign, this is also a magical time for love, beauty, and pleasure, so be sure to indulge yourself.The end of January brings forth a full moon on January 28 that turns your full attention on your partnerships. This may be a culmination regarding you deciding to make long-term plans or else part ways. Some Aquarians could become engaged or even marry. Others may sign contracts with business associates. However, time is of the absolute essence because Mercury, the ruler of communication, stations retrograde and turns backward in your zodiac sign on the thirtieth. Work with haste!Standout days: 9, 11, 20Challenging days: 8, 23, 30",
      "matches": [
        8,
        3,
        5
      ],
      "ratings": [
        3,
        3,
        3,
        3
      ],
      "money": []
    },
    "year": {
      "text": "\nThe new year is full of changes and challenges! Your home planet, Uranus, made a big move into steady Taurus last year, and these two very different energies aren't the best of friends. Uranus is experimental and Taurus likes to take a conservative approach, so there will be some mismatched energy to deal with now. The retrograde period for your power planet this year is from mid-August until the end of the year, which should give you a slight break from the need for outward rebellion. Turning that rebellious streak inward, however, can create its own set of issues, so be prepared for inner battles that can lead you down the path to self-destruction (and ultimately redemption) this year.✨Reveal what 2021 has in the stars for you with your Yearly Horoscope! ✨The sun always passes through your sign at the start of the year, so from the end of January until the end of February, you celebrate your birthday month. Happy birthday to you, style maker and game changer Aquarius! The sun forms a square to your home planet a couple days after its entrance into your sign, giving off a double dose of unpredictability. Watch out for a buildup of nervous tension over not knowing exactly what might happen next. You like your freedom, but you don't thrive on chaos.\n",
      "matches": [],
      "ratings": [],
      "money": [],
      "love": [],
      "career": [],
      "wellness": []
    }
  },
  {
    "today": {
      "text": "Jan 28, 2021 - Love, passion, romance, and marriage - your mind will focus on these matters all day even if there's no special person in your life right now, Pisces. If you are involved, don't be surprised if talk of a long-term commitment creeps into your conversations with your beloved. If you aren't involved, someone new and exciting could appear on the scene. When you go out, make sure you look your best.",
      "matches": [
        9,
        4,
        5
      ],
      "ratings": [
        4,
        4,
        4,
        3
      ],
      "money": []
    },
    "yesterday": {
      "text": "Jan 27, 2021 - A misunderstanding with a family member or partner could mar your morning, Pisces. One of you is less communicative than usual. It might take some effort to bring the issues into the open and work them out. They probably seem more serious than they are. Both you and the other person are apt to be stressed out and a little on edge. Cut yourselves some slack.",
      "matches": [
        9,
        4,
        6
      ],
      "ratings": [
        3,
        3,
        3,
        3
      ],
      "money": []
    },
    "tomorrow": {
      "text": "Jan 29, 2021 - Continued success and good fortune regarding finances could have you flying high right now, Pisces. You're probably glowing with self-confidence and may well be surrounded by good friends. There might even be some public acclaim. A few minor mishaps might occur today, but they certainly won't put a damper on the mood. Expect to have a wonderful day!",
      "matches": [
        8,
        2,
        5
      ],
      "ratings": [
        2,
        4,
        3,
        2
      ],
      "money": []
    },
    "week": {
      "text": "Jan 25, 2021 - Jan 31, 2021 - Say how you feel when the sun in Aquarius squares Uranus in Taurus on Tuesday. It might seem romantic and mysterious when you retreat into your inner world, but people could be concerned about your odd behavior. Don?t be passive-aggressive and make them guess how you feel?just say it!Fortunately, you?ll feel very vital and productive when the full moon is in vibrant Leo on Thursday. Whatever routine you?ve cultivated, it?s really paying off at work because you feel brighter, more energetic, and ready to reach your goals. Enjoy these good vibes.On Saturday, Mercury goes into retrograde in Aquarius, giving you all the feels. Mercury reverses in your sector of privacy, bringing all your hidden emotions to the surface. Be careful because your private life may become public. Focus on inner healing, and don?t post anything personal on social media. And please, don?t text your exes! ",
      "love": "Jan 25, 2021 - Jan 31, 2021 - It's hard to keep up with all the changes that can come during the sun-Uranus square early in the week, and it can be frustrating to even try. Rely on a close friend to fill you in when you aren't sure what's going on.A midweek Leo full moon can be intimidating due to the drama and passion it brings out in you and everyone around you. Getting some closure on a past relationship will make you feel better about moving on with someone new.Innovative Aquarius bonds the sun and Jupiter together during their conjunction about the same time and opens your world to different and unusual options. If you're in the mood to experiment, you're going to love this aspect! ",
      "career": "Jan 25, 2021 - Jan 31, 2021 - Trust your inner voice. Your ability to visualize positive results has a way of supporting your long-term interests. The energy can bring you to a kind of crossroads. It's a good time to apply for a new job or confront what isn't working in the job you have now. You'll have the courage to move in a new direction, if necessary. Team efforts are most satisfying.",
      "wellness": "Jan 25, 2021 - Jan 31, 2021 - All work and no play does make Jack or Jill pretty dull - and you're in danger of going that route. Don't spend all your days plodding along and feeling sorry for yourself. You need a break in order to rediscover the joys of life and regain that sense of vibrancy that coincides with good health. It might help to go slightly crazy and laugh a lot. Your body will thank you for it.",
      "money": "Jan 25, 2021 - Jan 31, 2021 - You have a lot of powerful energy helping you achieve your goals and build financial security for your family this week. The cosmos is providing you with opportunities to travel for work and learn a lot more on the job so you can charge more the next time around! Pay attention to what you can use. Since the planets are getting along famously, you have the ingredients for success at hand.",
      "matches": [
        9,
        4,
        5
      ],
      "ratings": [
        4,
        4,
        4,
        3
      ]
    },
    "month": {
      "text": "January 2021 - Fun, laughter, and social vibrations fill your life as the sun ignites your solar eleventh house at the onset of the year. With a new moon also opening a doorway in this area of your life on January 12, it is quite likely that you will hear from many friends and even make a new one at this time, too! Expanding your network and joining communities will bring you happiness and purpose if you choose to do so now. You may also attend a lovely event during this time.As Mars enters your solar third house, yet another area of focus this month is on significant communication-related projects, such as writing, speaking, or advertising initiatives. It will continue to power up your voice until March, so expect to launch things during this time. However, be aware that Mercury, the ruler of communication, is retrograde throughout most of February, so you must use your time now to make the agreements that you want to last.?Mark down the best dates for your zodiac sign with your Pisces Monthly Horoscope! ?There will also be a lot of planetary activity in your solar twelfth house of privacy, assuring that your dreams and intuition are quite active now. Use this energy to get creative or brainstorm long-term life goals.As the month draws to a close, you will likely feel of burst of activity as a full moon in your solar sixth house of productivity ignites in the night on January 28. This luminary may see you finishing up an important project or offer you an opportunity for employment. Some Pisces could even swiftly move from one job to another.Standout days: 1, 23, 28Challenging days: 12, 13, 17",
      "matches": [
        9,
        4,
        5
      ],
      "ratings": [
        4,
        4,
        4,
        3
      ],
      "money": []
    },
    "year": {
      "text": "\nA mix of illusion and reality shapes your year.Your home planet Neptune supports your idealistic approach to life, and because it's traveling in your escapist sign all year, this is the time to really dream big. Pay attention to intuition and visions - your subconscious is an accurate window into your soul and what you truly want this year.✨Reveal what 2021 has in the stars for you with your Yearly Horoscope! ✨Neptune's retrograde period occurs from late June until the end of November, however, which can cause all your daydreams to come crashing down. Having the soft, pillowy layers of plausible deniability you've built around you can be unnerving, and you won't want to face the realities that slowly creep in. You're tougher than you seem though, Pisces, so having to face the music can be a blessing in disguise.The sun will be floating through your imaginative sign from the end of February until the end of March, so happy birthday to you creative, romantic Pisces! You thrive living in your dream world, and you crave solitude to contemplate all of life's \"what ifs.\" Because you're the last sign of the Zodiac and because this transit occurs during the Spring Equinox, this is a time to embrace the ending of one cycle and the beginning of a new one. Take a breather, Pisces, and regain your strength before it's time to start all over again.\n",
      "matches": [],
      "ratings": [],
      "money": [],
      "love": [],
      "career": [],
      "wellness": []
    }
  }
]